[Killed] ConditionalExpression
src/main/components/OurTable.jsx:121:14
                 {1}
               </Pagination.Item>
             )}
-            {pageIndex > 4 && (
+            {true && (
               <Pagination.Ellipsis data-testid={`${testid}-left-ellipsis`} />
             )}
killedBy: OurTable tests renders a table with 51 rows and tests the first page
statusReason: expected <a class="page-link" …(4)>…(2)</a> to be null // Object.is equality
