[Killed] BlockStatement
src/main/utils/dateUtils.js:16:38
   );
 };
 
-const daysSinceTimestamp = (date) => {
-  var today = new Date();
-  var startingDate = new Date(date);
-  // calculate difference in calendar days (ignore time-of-day)
-  var utcToday = Date.UTC(today.getFullYear(), today.getMonth(), today.getDate());
-  var utcStart = Date.UTC(
-    startingDate.getFullYear(),
-    startingDate.getMonth(),
-    startingDate.getDate(),
-  );
-  return Math.floor((utcToday - utcStart) / (1000 * 3600 * 24));
-};
+const daysSinceTimestamp = (date) => {};
 
 const minutesInSeconds = 60;
killedBy: dateUtils tests daysSinceTimestamp tests calculates days properly
statusReason: expected undefined to be 9 // Object.is equality

[Killed] ArithmeticOperator
src/main/utils/dateUtils.js:26:46
     startingDate.getMonth(),
     startingDate.getDate(),
   );
-  return Math.floor((utcToday - utcStart) / (1000 * 3600 * 24));
+  return Math.floor((utcToday - utcStart) / (1000 * 3600 / 24));
 };
 
killedBy: dateUtils tests daysSinceTimestamp tests calculates days properly
statusReason: expected 5184 to be 9 // Object.is equality

[Killed] ArithmeticOperator
src/main/utils/dateUtils.js:26:21
     startingDate.getMonth(),
     startingDate.getDate(),
   );
-  return Math.floor((utcToday - utcStart) / (1000 * 3600 * 24));
+  return Math.floor((utcToday - utcStart) * (1000 * 3600 * 24));
 };
 
killedBy: dateUtils tests daysSinceTimestamp tests calculates days properly
statusReason: expected 67184640000000000 to be 9 // Object.is equality

[Killed] ArithmeticOperator
src/main/utils/dateUtils.js:43:21
   const dateFromEpoch = new Date(timeString);
   const secondsPast = Math.floor((now - dateFromEpoch) / 1000);
 
-  if (secondsPast < minutesInSeconds * 2) {
+  if (secondsPast < minutesInSeconds / 2) {
     return "Online now";
   }
killedBy: dateUtils tests formatTime tests should return `Online now` for less than 2 minutes
statusReason: expected '1 minutes ago' to deeply equal 'Online now'

[Killed] EqualityOperator
src/main/utils/dateUtils.js:43:7
   const dateFromEpoch = new Date(timeString);
   const secondsPast = Math.floor((now - dateFromEpoch) / 1000);
 
-  if (secondsPast < minutesInSeconds * 2) {
+  if (secondsPast <= minutesInSeconds * 2) {
     return "Online now";
   }
killedBy: dateUtils tests formatTime tests should return 2 minutes ago for exactly 2 minutes
statusReason: expected 'Online now' to deeply equal '2 minutes ago'

[Killed] BlockStatement
src/main/utils/dateUtils.js:52:35
     return `${minutes} minutes ago`;
   }
 
-  if (secondsPast < dayInSeconds) {
-    const hours = Math.floor(secondsPast / 3600);
-    return `${hours} hour${hours > 1 ? "s" : ""} ago`;
-  }
+  if (secondsPast < dayInSeconds) {}
 
   if (secondsPast < weekInSeconds) {
killedBy: dateUtils tests formatTime tests should return hours ago format
statusReason: expected '0 day ago' to deeply equal '3 hours ago'

[Killed] ConditionalExpression
src/main/utils/dateUtils.js:54:28
 
   if (secondsPast < dayInSeconds) {
     const hours = Math.floor(secondsPast / 3600);
-    return `${hours} hour${hours > 1 ? "s" : ""} ago`;
+    return `${hours} hour${true ? "s" : ""} ago`;
   }
 
killedBy: dateUtils tests formatTime tests should return 1 hour ago for 1 hour
statusReason: expected '1 hours ago' to deeply equal '1 hour ago'

[Killed] EqualityOperator
src/main/utils/dateUtils.js:59:26
 
   if (secondsPast < weekInSeconds) {
     const days = Math.floor(secondsPast / 86400);
-    return `${days} day${days > 1 ? "s" : ""} ago`;
+    return `${days} day${days <= 1 ? "s" : ""} ago`;
   }
 
killedBy: dateUtils tests formatTime tests should return days ago format
statusReason: expected '2 day ago' to deeply equal '2 days ago'

[Killed] ConditionalExpression
src/main/utils/dateUtils.js:59:26
 
   if (secondsPast < weekInSeconds) {
     const days = Math.floor(secondsPast / 86400);
-    return `${days} day${days > 1 ? "s" : ""} ago`;
+    return `${days} day${true ? "s" : ""} ago`;
   }
 
killedBy: dateUtils tests formatTime tests should return 1 day ago for 1 day
statusReason: expected '1 days ago' to deeply equal '1 day ago'
