[Killed] ObjectLiteral
main/components/Reports/ReportHeaderTable.jsx:8:5
 // should take in a players list from a commons
 export default function ReportHeaderTable({ report }) {
   const columns = [
-    {
-      Header: "Cow Price",
-      accessor: "cowPrice",
-      Cell: (props) => {
-        return <div style={{ textAlign: "right" }}>{props.value}</div>;
-      },
-    },
+    {},
     {
       Header: "Milk Price",
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: A column ID (or string accessor) is required!

[Killed] BlockStatement
main/components/Reports/ReportHeaderTable.jsx:11:24
     {
       Header: "Cow Price",
       accessor: "cowPrice",
-      Cell: (props) => {
-        return <div style={{ textAlign: "right" }}>{props.value}</div>;
-      },
+      Cell: (props) => {},
     },
     {
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  100
Received:

[Killed] ObjectLiteral
main/components/Reports/ReportHeaderTable.jsx:15:5
         return <div style={{ textAlign: "right" }}>{props.value}</div>;
       },
     },
-    {
-      Header: "Milk Price",
-      accessor: "milkPrice",
-      Cell: (props) => {
-        return <div style={{ textAlign: "right" }}>{props.value}</div>;
-      },
-    },
+    {},
     {
       Header: "Start Bal",
killedBy: AdminViewReportPage tests renders correctly for admin user
statusReason: A column ID (or string accessor) is required!

[Killed] BlockStatement
main/components/Reports/ReportHeaderTable.jsx:18:24
     {
       Header: "Milk Price",
       accessor: "milkPrice",
-      Cell: (props) => {
-        return <div style={{ textAlign: "right" }}>{props.value}</div>;
-      },
+      Cell: (props) => {},
     },
     {
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  5
Received:

[Killed] BlockStatement
main/components/Reports/ReportHeaderTable.jsx:25:24
     {
       Header: "Start Bal",
       accessor: "startingBalance",
-      Cell: (props) => {
-        return (
-          <div style={{ textAlign: "right" }}>
-            {formatter.format(props.value)}
-          </div>
-        );
-      },
+      Cell: (props) => {},
     },
     {
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  $10,000.00
Received:

[Killed] ObjectLiteral
main/components/Reports/ReportHeaderTable.jsx:33:5
         );
       },
     },
-    {
-      Header: "Start Date",
-      id: "startingDate",
-      accessor: (row, _rowIndex) => String(row.startingDate).substring(0, 10),
-    },
+    {},
     {
       Header: "Leaderboard",
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Reports/ReportHeaderTable.jsx:34:15
       },
     },
     {
-      Header: "Start Date",
+      Header: "",
       id: "startingDate",
       accessor: (row, _rowIndex) => String(row.startingDate).substring(0, 10),
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Start Date
Received:

[Killed] StringLiteral
main/components/Reports/ReportHeaderTable.jsx:35:11
     },
     {
       Header: "Start Date",
-      id: "startingDate",
+      id: "",
       accessor: (row, _rowIndex) => String(row.startingDate).substring(0, 10),
     },
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: Unable to find an element by: [data-testid="ReportHeaderTable-header-startingDate"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] MethodExpression
main/components/Reports/ReportHeaderTable.jsx:36:37
     {
       Header: "Start Date",
       id: "startingDate",
-      accessor: (row, _rowIndex) => String(row.startingDate).substring(0, 10),
+      accessor: (row, _rowIndex) => String(row.startingDate),
     },
     {
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  /^2023-08-06$/
Received:
  2023-08-06T00:00:00

[Killed] ArrowFunction
main/components/Reports/ReportHeaderTable.jsx:36:17
     {
       Header: "Start Date",
       id: "startingDate",
-      accessor: (row, _rowIndex) => String(row.startingDate).substring(0, 10),
+      accessor: () => undefined,
     },
     {
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  /^2023-08-06$/
Received:

[Killed] ObjectLiteral
main/components/Reports/ReportHeaderTable.jsx:38:5
       id: "startingDate",
       accessor: (row, _rowIndex) => String(row.startingDate).substring(0, 10),
     },
-    {
-      Header: "Leaderboard",
-      id: "showLeaderboard",
-      accessor: (row, _rowIndex) => String(row.showLeaderboard), // hack needed for boolean values to show up
-    },
+    {},
     {
       Header: "Capacity",
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Reports/ReportHeaderTable.jsx:41:17
     {
       Header: "Leaderboard",
       id: "showLeaderboard",
-      accessor: (row, _rowIndex) => String(row.showLeaderboard), // hack needed for boolean values to show up
+      accessor: () => undefined, // hack needed for boolean values to show up
     },
     {
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  true
Received:

[Killed] StringLiteral
main/components/Reports/ReportHeaderTable.jsx:44:15
       accessor: (row, _rowIndex) => String(row.showLeaderboard), // hack needed for boolean values to show up
     },
     {
-      Header: "Capacity",
+      Header: "",
       accessor: "carryingCapacity",
       Cell: (props) => {
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Capacity
Received:

[Killed] BlockStatement
main/components/Reports/ReportHeaderTable.jsx:46:24
     {
       Header: "Capacity",
       accessor: "carryingCapacity",
-      Cell: (props) => {
-        return <div style={{ textAlign: "right" }}>{props.value}</div>;
-      },
+      Cell: (props) => {},
     },
     {
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  10
Received:

[Killed] ObjectLiteral
main/components/Reports/ReportHeaderTable.jsx:50:5
         return <div style={{ textAlign: "right" }}>{props.value}</div>;
       },
     },
-    {
-      Header: "Degrad Rate",
-      accessor: "degradationRate",
-      Cell: (props) => {
-        return <div style={{ textAlign: "right" }}>{props.value}</div>;
-      },
-    },
+    {},
     {
       Header: "BelowCap",
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Reports/ReportHeaderTable.jsx:52:17
     },
     {
       Header: "Degrad Rate",
-      accessor: "degradationRate",
+      accessor: "",
       Cell: (props) => {
         return <div style={{ textAlign: "right" }}>{props.value}</div>;
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: Unable to find an element by: [data-testid="ReportHeaderTable-header-degradationRate"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] BlockStatement
main/components/Reports/ReportHeaderTable.jsx:53:24
     {
       Header: "Degrad Rate",
       accessor: "degradationRate",
-      Cell: (props) => {
-        return <div style={{ textAlign: "right" }}>{props.value}</div>;
-      },
+      Cell: (props) => {},
     },
     {
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  0.1
Received:

[Killed] StringLiteral
main/components/Reports/ReportHeaderTable.jsx:58:15
       },
     },
     {
-      Header: "BelowCap",
+      Header: "",
       accessor: "belowCapacityHealthUpdateStrategy",
     },
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  BelowCap
Received:

[Killed] StringLiteral
main/components/Reports/ReportHeaderTable.jsx:59:17
     },
     {
       Header: "BelowCap",
-      accessor: "belowCapacityHealthUpdateStrategy",
+      accessor: "",
     },
     {
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: Unable to find an element by: [data-testid="ReportHeaderTable-header-belowCapacityHealthUpdateStrategy"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] StringLiteral
main/components/Reports/ReportHeaderTable.jsx:62:15
       accessor: "belowCapacityHealthUpdateStrategy",
     },
     {
-      Header: "AboveCap",
+      Header: "",
       accessor: "aboveCapacityHealthUpdateStrategy",
     },
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  AboveCap
Received:
