[Killed] BlockStatement
src/main/utils/dateUtils.js:1:28
-const padWithZero = (n) => {
-  return n < 10 ? "0" + n : n;
-};
+const padWithZero = (n) => {};
 
 const timestampToDate = (timestamp) => {
killedBy: PagedProfitsTable tests renders correct content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  2024-06-16
Received:
  2024-undefined-undefined

[Killed] ConditionalExpression
src/main/utils/dateUtils.js:2:10
 const padWithZero = (n) => {
-  return n < 10 ? "0" + n : n;
+  return false ? "0" + n : n;
 };
 
killedBy: PagedProfitsTable tests renders correct content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  2024-06-16
Received:
  2024-6-16

[Killed] EqualityOperator
src/main/utils/dateUtils.js:2:10
 const padWithZero = (n) => {
-  return n < 10 ? "0" + n : n;
+  return n <= 10 ? "0" + n : n;
 };
 
killedBy: dateUtils tests padWithZero tests does not pad with 10 or greater
statusReason: expected '010' to be 10 // Object.is equality

[Killed] BlockStatement
src/main/utils/dateUtils.js:5:40
   return n < 10 ? "0" + n : n;
 };
 
-const timestampToDate = (timestamp) => {
-  var date = new Date(timestamp);
-  return (
-    date.getFullYear() +
-    "-" +
-    padWithZero(date.getMonth() + 1) +
-    "-" +
-    padWithZero(date.getDate())
-  );
-};
+const timestampToDate = (timestamp) => {};
 
 const daysSinceTimestamp = (date) => {
killedBy: PagedProfitsTable tests renders correct content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  2024-06-16
Received:

[Killed] ArithmeticOperator
src/main/utils/dateUtils.js:10:17
   return (
     date.getFullYear() +
     "-" +
-    padWithZero(date.getMonth() + 1) +
+    padWithZero(date.getMonth() - 1) +
     "-" +
     padWithZero(date.getDate())
killedBy: PagedProfitsTable tests renders correct content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  2024-06-16
Received:
  2024-04-16

[Killed] BlockStatement
src/main/utils/dateUtils.js:16:38
   );
 };
 
-const daysSinceTimestamp = (date) => {
-  var today = new Date();
-  var startingDate = new Date(date);
-  // calculate difference in calendar days (ignore time-of-day)
-  var utcToday = Date.UTC(
-    today.getFullYear(),
-    today.getMonth(),
-    today.getDate(),
-  );
-  var utcStart = Date.UTC(
-    startingDate.getFullYear(),
-    startingDate.getMonth(),
-    startingDate.getDate(),
-  );
-  return Math.floor((utcToday - utcStart) / (1000 * 3600 * 24));
-};
+const daysSinceTimestamp = (date) => {};
 
 const minutesInSeconds = 60;
killedBy: dateUtils tests daysSinceTimestamp tests calculates days properly
statusReason: expected undefined to be 9 // Object.is equality

[Killed] ArithmeticOperator
src/main/utils/dateUtils.js:30:46
     startingDate.getMonth(),
     startingDate.getDate(),
   );
-  return Math.floor((utcToday - utcStart) / (1000 * 3600 * 24));
+  return Math.floor((utcToday - utcStart) / (1000 / 3600 * 24));
 };
 
killedBy: dateUtils tests daysSinceTimestamp tests calculates days properly
statusReason: expected 116640000 to be 9 // Object.is equality

[Killed] ArithmeticOperator
src/main/utils/dateUtils.js:30:22
     startingDate.getMonth(),
     startingDate.getDate(),
   );
-  return Math.floor((utcToday - utcStart) / (1000 * 3600 * 24));
+  return Math.floor((utcToday + utcStart) / (1000 * 3600 * 24));
 };
 
killedBy: dateUtils tests daysSinceTimestamp tests calculates days properly
statusReason: expected 38279 to be 9 // Object.is equality

[Killed] ConditionalExpression
src/main/utils/dateUtils.js:39:7
 const weekInSeconds = 7 * dayInSeconds;
 
 export function formatTime(timeString) {
-  if (!timeString) {
+  if (true) {
     return "";
   }
killedBy: dateUtils tests formatTime tests should return `Online now` for less than 2 minutes
statusReason: expected '' to deeply equal 'Online now'

[Killed] BlockStatement
src/main/utils/dateUtils.js:47:43
   const dateFromEpoch = new Date(timeString);
   const secondsPast = Math.floor((now - dateFromEpoch) / 1000);
 
-  if (secondsPast < minutesInSeconds * 2) {
-    return "Online now";
-  }
+  if (secondsPast < minutesInSeconds * 2) {}
 
   if (secondsPast < hourInSeconds) {
killedBy: dateUtils tests formatTime tests should return `Online now` for less than 2 minutes
statusReason: expected '1 minutes ago' to deeply equal 'Online now'

[Killed] EqualityOperator
src/main/utils/dateUtils.js:56:7
     return `${minutes} minutes ago`;
   }
 
-  if (secondsPast < dayInSeconds) {
+  if (secondsPast >= dayInSeconds) {
     const hours = Math.floor(secondsPast / 3600);
     return `${hours} hour${hours > 1 ? "s" : ""} ago`;
killedBy: dateUtils tests formatTime tests should return hours ago format
statusReason: expected '0 day ago' to deeply equal '3 hours ago'

[Killed] EqualityOperator
src/main/utils/dateUtils.js:58:28
 
   if (secondsPast < dayInSeconds) {
     const hours = Math.floor(secondsPast / 3600);
-    return `${hours} hour${hours > 1 ? "s" : ""} ago`;
+    return `${hours} hour${hours <= 1 ? "s" : ""} ago`;
   }
 
killedBy: dateUtils tests formatTime tests should return hours ago format
statusReason: expected '3 hour ago' to deeply equal '3 hours ago'

[Killed] EqualityOperator
src/main/utils/dateUtils.js:58:28
 
   if (secondsPast < dayInSeconds) {
     const hours = Math.floor(secondsPast / 3600);
-    return `${hours} hour${hours > 1 ? "s" : ""} ago`;
+    return `${hours} hour${hours >= 1 ? "s" : ""} ago`;
   }
 
killedBy: dateUtils tests formatTime tests should return 1 hour ago for 1 hour
statusReason: expected '1 hours ago' to deeply equal '1 hour ago'

[Killed] BlockStatement
src/main/utils/dateUtils.js:61:36
     return `${hours} hour${hours > 1 ? "s" : ""} ago`;
   }
 
-  if (secondsPast < weekInSeconds) {
-    const days = Math.floor(secondsPast / 86400);
-    return `${days} day${days > 1 ? "s" : ""} ago`;
-  }
+  if (secondsPast < weekInSeconds) {}
 
   return dateFromEpoch.toLocaleDateString();
killedBy: dateUtils tests formatTime tests should return days ago format
statusReason: expected '5/30/2022' to deeply equal '2 days ago'

[Killed] EqualityOperator
src/main/utils/dateUtils.js:63:26
 
   if (secondsPast < weekInSeconds) {
     const days = Math.floor(secondsPast / 86400);
-    return `${days} day${days > 1 ? "s" : ""} ago`;
+    return `${days} day${days >= 1 ? "s" : ""} ago`;
   }
 
killedBy: dateUtils tests formatTime tests should return 1 day ago for 1 day
statusReason: expected '1 days ago' to deeply equal '1 day ago'

[Killed] ConditionalExpression
src/main/utils/dateUtils.js:63:26
 
   if (secondsPast < weekInSeconds) {
     const days = Math.floor(secondsPast / 86400);
-    return `${days} day${days > 1 ? "s" : ""} ago`;
+    return `${days} day${false ? "s" : ""} ago`;
   }
 
killedBy: dateUtils tests formatTime tests should return days ago format
statusReason: expected '2 day ago' to deeply equal '2 days ago'
