[Killed] ObjectLiteral
src/main/pages/AdminJobsPage.jsx:174:58
     InstructorReportSpecificCommonsMutation.mutate(data);
   };
 
-  const objectToAxiosParamsRecordCommonStatsJob = () => ({
-    url: `/api/jobs/launch/recordcommonstats`,
-    method: "POST",
-  });
+  const objectToAxiosParamsRecordCommonStatsJob = () => ({});
 
   // Stryker disable all
killedBy: AdminJobsPage tests user can submit record common stats job
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div
