[Killed] BlockStatement
main/components/Jobs/RecordCommonStatsJobForm.jsx:4:53
 import { Button, Form } from "react-bootstrap";
 import { useForm } from "react-hook-form";
 
-function RecordCommonStatsJobForm({ submitAction }) {
-  const { handleSubmit } = useForm();
-
-  return (
-    <Form onSubmit={handleSubmit(submitAction)}>
-      <p>Click this button to record common stats!</p>
-      <Button type="submit" data-testid="RecordCommonStatsForm-Submit-Button">
-        Record Stats
-      </Button>
-    </Form>
-  );
-}
+function RecordCommonStatsJobForm({ submitAction }) {}
 export default RecordCommonStatsJobForm;
 
killedBy: AdminJobsPage tests user can submit record common stats job
statusReason: Unable to find an element by: [data-testid="RecordCommonStatsForm-Submit-Button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
