[Killed] BooleanLiteral
src/main/pages/PlayPage.jsx:75:46
     {},
   );
 
-  const commonsPlusExists = !!commonsPlus && !!commonsPlus.commons;
+  const commonsPlusExists = !!commonsPlus && !commonsPlus.commons;
   let commonsforuser;
   let matched;
killedBy: PlayPage tests renders without crashing
statusReason: Unable to find an element by: [data-testid="commonsPlay-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(/src/assets/PlayPageBackground.jpg);"

[Killed] BooleanLiteral
src/main/pages/PlayPage.jsx:75:29
     {},
   );
 
-  const commonsPlusExists = !!commonsPlus && !!commonsPlus.commons;
+  const commonsPlusExists = !commonsPlus && !!commonsPlus.commons;
   let commonsforuser;
   let matched;
killedBy: PlayPage tests renders without crashing
statusReason: Cannot read properties of undefined (reading 'commons')

[Killed] LogicalOperator
src/main/pages/PlayPage.jsx:80:5
   let matched;
 
   if (
-    commonsPlusExists &&
-    currentUser &&
-    currentUser.root &&
-    currentUser.root.user &&
-    currentUser.root.user.commons
+    commonsPlusExists && currentUser && currentUser.root && currentUser.root.user || currentUser.root.user.commons
   ) {
     commonsforuser = currentUser.root.user.commons;
killedBy: PlayPage tests renders without crashing
statusReason: Cannot read properties of null (reading 'user')

[Killed] ConditionalExpression
src/main/pages/PlayPage.jsx:80:5
   let matched;
 
   if (
-    commonsPlusExists &&
-    currentUser &&
-    currentUser.root &&
-    currentUser.root.user &&
-    currentUser.root.user.commons
+    false
   ) {
     commonsforuser = currentUser.root.user.commons;
killedBy: PlayPage tests renders without crashing
statusReason: Unable to find an element by: [data-testid="commonsPlay-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(/src/assets/PlayPageBackground.jpg);"

[Killed] BlockStatement
src/main/pages/PlayPage.jsx:85:5
     currentUser.root &&
     currentUser.root.user &&
     currentUser.root.user.commons
-  ) {
-    commonsforuser = currentUser.root.user.commons;
-    matched = commonsforuser.some((com) => com.id === commonsPlus.commons.id);
-  }
+  ) {}
 
   const allowed = commonsPlusExists && matched && !commonsPlus.commons.hidden;
killedBy: PlayPage tests renders without crashing
statusReason: Unable to find an element by: [data-testid="commonsPlay-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(/src/assets/PlayPageBackground.jpg);"

[Killed] MethodExpression
src/main/pages/PlayPage.jsx:87:15
     currentUser.root.user.commons
   ) {
     commonsforuser = currentUser.root.user.commons;
-    matched = commonsforuser.some((com) => com.id === commonsPlus.commons.id);
+    matched = commonsforuser.every(com => com.id === commonsPlus.commons.id);
   }
 
killedBy: PlayPage tests renders without crashing
statusReason: Unable to find an element by: [data-testid="commonsPlay-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(/src/assets/PlayPageBackground.jpg);"

[Killed] LogicalOperator
src/main/pages/PlayPage.jsx:90:19
     matched = commonsforuser.some((com) => com.id === commonsPlus.commons.id);
   }
 
-  const allowed = commonsPlusExists && matched && !commonsPlus.commons.hidden;
+  const allowed = commonsPlusExists && matched || !commonsPlus.commons.hidden;
   const notallowed = commonsPlusExists && !matched;
   const hidden = commonsPlusExists && commonsPlus.commons.hidden;
killedBy: PlayPage tests renders without crashing
statusReason: Cannot read properties of undefined (reading 'commons')

[Killed] LogicalOperator
src/main/pages/PlayPage.jsx:90:19
     matched = commonsforuser.some((com) => com.id === commonsPlus.commons.id);
   }
 
-  const allowed = commonsPlusExists && matched && !commonsPlus.commons.hidden;
+  const allowed = commonsPlusExists || matched && !commonsPlus.commons.hidden;
   const notallowed = commonsPlusExists && !matched;
   const hidden = commonsPlusExists && commonsPlus.commons.hidden;
killedBy: PlayPage tests User that has not joined any commons is trying to access an unjoined common
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="woodentitle card"
  data-testid="commons-card"
>
  <div
    class="text-center border-0 my-3"

[Killed] LogicalOperator
src/main/pages/PlayPage.jsx:91:22
   }
 
   const allowed = commonsPlusExists && matched && !commonsPlus.commons.hidden;
-  const notallowed = commonsPlusExists && !matched;
+  const notallowed = commonsPlusExists || !matched;
   const hidden = commonsPlusExists && commonsPlus.commons.hidden;
 
killedBy: PlayPage tests User that has joined one commons is trying to access a joined common
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <h1>
  You have yet to join this commons!
</h1> instead

[Killed] ConditionalExpression
src/main/pages/PlayPage.jsx:198:12
     >
       <BasicLayout>
         <Container>
-          {(!commonsPlus || !commonsPlus.commons) && (
-            <h1>This commons does not exist!</h1>
-          )}
+          {false}
           {notallowed && <h1>You have yet to join this commons!</h1>}
           {hidden && (
killedBy: PlayPage tests User not allowed to access a commons that does not exist
statusReason: Unable to find an element with the text: This commons does not exist!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>

[Killed] ConditionalExpression
src/main/pages/PlayPage.jsx:198:12
     >
       <BasicLayout>
         <Container>
-          {(!commonsPlus || !commonsPlus.commons) && (
-            <h1>This commons does not exist!</h1>
-          )}
+          {true}
           {notallowed && <h1>You have yet to join this commons!</h1>}
           {hidden && (
killedBy: PlayPage tests User not allowed to access a commons that does not exist
statusReason: Unable to find an element with the text: This commons does not exist!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>

[Killed] LogicalOperator
src/main/pages/PlayPage.jsx:201:12
           {(!commonsPlus || !commonsPlus.commons) && (
             <h1>This commons does not exist!</h1>
           )}
-          {notallowed && <h1>You have yet to join this commons!</h1>}
+          {notallowed || <h1>You have yet to join this commons!</h1>}
           {hidden && (
             <h1>This commons has been hidden by the site administrator.</h1>
killedBy: PlayPage tests User that has joined one commons is trying to access an unjoined common
statusReason: Unable to find an element with the text: You have yet to join this commons!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>

[Killed] ConditionalExpression
src/main/pages/PlayPage.jsx:201:12
           {(!commonsPlus || !commonsPlus.commons) && (
             <h1>This commons does not exist!</h1>
           )}
-          {notallowed && <h1>You have yet to join this commons!</h1>}
+          {false}
           {hidden && (
             <h1>This commons has been hidden by the site administrator.</h1>
killedBy: PlayPage tests User that has not joined any commons is trying to access an unjoined common
statusReason: Unable to find an element with the text: You have yet to join this commons!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>

[Killed] ConditionalExpression
src/main/pages/PlayPage.jsx:216:12
             />
           )}
           <br />
-          {allowed && !!userCommons && !!commonsPlus && (
-            <CardGroup>
-              <ManageCows
-                userCommons={userCommons}
-                commons={commonsPlus.commons}
-                setMessage={setMessage}
-                openModal={openModal}
-              />
-              <FarmStats userCommons={userCommons} />
-              <Profits userCommons={userCommons} profits={userCommonsProfits} />
-              <ManageCowsModal
-                number={numCows}
-                setNumber={setNumCows}
-                userCommons={userCommons}
-                isOpen={isModalOpen}
-                message={message}
-                onClose={closeModal}
-                onBuy={onBuy}
-                onSell={onSell}
-              />
-            </CardGroup>
-          )}
+          {false}
         </Container>
       </BasicLayout>
killedBy: PlayPage tests renders without crashing
statusReason: Unable to find an element by: [data-testid="ManageCows"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(/src/assets/PlayPageBackground.jpg);"

[Killed] LogicalOperator
src/main/pages/PlayPage.jsx:216:12
             />
           )}
           <br />
-          {allowed && !!userCommons && !!commonsPlus && (
-            <CardGroup>
-              <ManageCows
-                userCommons={userCommons}
-                commons={commonsPlus.commons}
-                setMessage={setMessage}
-                openModal={openModal}
-              />
-              <FarmStats userCommons={userCommons} />
-              <Profits userCommons={userCommons} profits={userCommonsProfits} />
-              <ManageCowsModal
-                number={numCows}
-                setNumber={setNumCows}
-                userCommons={userCommons}
-                isOpen={isModalOpen}
-                message={message}
-                onClose={closeModal}
-                onBuy={onBuy}
-                onSell={onSell}
-              />
-            </CardGroup>
-          )}
+          {allowed && !!userCommons && !!commonsPlus || <CardGroup>
+              <ManageCows userCommons={userCommons} commons={commonsPlus.commons} setMessage={setMessage} openModal={openModal} />
+              <FarmStats userCommons={userCommons} />
+              <Profits userCommons={userCommons} profits={userCommonsProfits} />
+              <ManageCowsModal number={numCows} setNumber={setNumCows} userCommons={userCommons} isOpen={isModalOpen} message={message} onClose={closeModal} onBuy={onBuy} onSell={onSell} />
+            </CardGroup>}
         </Container>
       </BasicLayout>
killedBy: PlayPage tests renders without crashing
statusReason: Cannot read properties of undefined (reading 'commons')

[Killed] BooleanLiteral
src/main/pages/PlayPage.jsx:241:22
         </Container>
       </BasicLayout>
       {(hasRole(currentUser, "ROLE_ADMIN") ||
-        (allowed && !!commonsPlus && commonsFeatures?.SHOW_CHAT)) && (
+        (allowed && !commonsPlus && commonsFeatures?.SHOW_CHAT)) && (
         <div style={chatContainerStyle} data-testid="playpage-chat-div">
           {!!isChatOpen && <ChatPanel commonsId={commonsId} />}
killedBy: PlayPage tests renders without crashing
statusReason: Unable to find an element by: [data-testid="playpage-chat-div"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(/src/assets/PlayPageBackground.jpg);"
