[Killed] StringLiteral
main/components/Commons/AdminCommonsCard.jsx:219:28
               variant="success"
               size="sm"
               href={`/api/commonstats/download?commonsId=${commons.id}`}
-              data-testid={`AdminCommonsCard-StatsCSV-${commons.id}`}
+              data-testid={``}
             >
               Stats CSV
killedBy: AdminCommonsCard tests stats CSV button has correct href
statusReason: Unable to find an element by: [data-testid="AdminCommonsCard-StatsCSV-1"]

Ignored nodes: comments, script, style
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>

[Killed] StringLiteral
main/components/Commons/AdminCommonsCard.jsx:235:28
               variant="warning"
               size="sm"
               onClick={handleChat}
-              data-testid={`AdminCommonsCard-Chat-${commons.id}`}
+              data-testid={``}
             >
               Chat
killedBy: AdminCommonsCard tests chat button navigates to admin chat page
statusReason: Unable to find an element by: [data-testid="AdminCommonsCard-Chat-1"]

Ignored nodes: comments, script, style
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
