[Killed] ObjectLiteral
main/components/Commons/CommonsForm.jsx:273:16
 
       <Row
         className="mt-1 flex justify-content-start"
-        style={{ width: "80%" }}
+        style={{}}
         data-testid={`${testid}-r2`}
       >
killedBy: AdminEditCommonsPage tests tests where backend is working normally Is populated with the data provided
statusReason: Found a label with the text of: /When above capacity/, however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/Commons/CommonsForm.jsx:390:27
       <Row>
         <Form.Group
           className="mb-5"
-          style={{ width: "300px", height: "50px" }}
+          style={{ width: "", height: "50px" }}
           data-testid={`${testid}-r3`}
         >
killedBy: AdminEditCommonsPage tests tests where backend is working normally Is populated with the data provided
statusReason: Found a label with the text of: /When above capacity/, however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/components/Commons/CommonsForm.jsx:412:18
 
         <Form.Group
           className="mb-5"
-          style={{ width: "300px", height: "50px" }}
+          style={{}}
           data-testid={`${testid}-r4`}
         >
killedBy: AdminEditCommonsPage tests tests where backend is working normally Is populated with the data provided
statusReason: Found a label with the text of: /When above capacity/, however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/Commons/CommonsForm.jsx:413:24
         <Form.Group
           className="mb-5"
           style={{ width: "300px", height: "50px" }}
-          data-testid={`${testid}-r4`}
+          data-testid={``}
         >
           <Form.Label htmlFor="lastDate">Last Date</Form.Label>
killedBy: AdminEditCommonsPage tests tests where backend is working normally Is populated with the data provided
statusReason: Found a label with the text of: /When above capacity/, however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
