[Killed] ConditionalExpression
main/components/Commons/CommonsOverview.jsx:33:5
   );
 
   const showLeaderboard =
-    hasRole(currentUser, "ROLE_ADMIN") ||
-    commonsFeatures?.FARMERS_CAN_SEE_LEADERBOARD;
+    false;
   return (
     <Card data-testid="CommonsOverview">
killedBy: CommonsOverview tests Redirects to the LeaderboardPage for an admin when you click visit
statusReason: Unable to find an element by: [data-testid="user-leaderboard-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="card"
      data-testid="CommonsOverview"

[Killed] LogicalOperator
main/components/Commons/CommonsOverview.jsx:33:5
   );
 
   const showLeaderboard =
-    hasRole(currentUser, "ROLE_ADMIN") ||
-    commonsFeatures?.FARMERS_CAN_SEE_LEADERBOARD;
+    hasRole(currentUser, "ROLE_ADMIN") && commonsFeatures?.FARMERS_CAN_SEE_LEADERBOARD;
   return (
     <Card data-testid="CommonsOverview">
killedBy: CommonsOverview tests Redirects to the LeaderboardPage for an admin when you click visit
statusReason: Unable to find an element by: [data-testid="user-leaderboard-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="card"
      data-testid="CommonsOverview"

[Killed] OptionalChaining
main/components/Commons/CommonsOverview.jsx:34:5
 
   const showLeaderboard =
     hasRole(currentUser, "ROLE_ADMIN") ||
-    commonsFeatures?.FARMERS_CAN_SEE_LEADERBOARD;
+    commonsFeatures.FARMERS_CAN_SEE_LEADERBOARD;
   return (
     <Card data-testid="CommonsOverview">
killedBy: CommonsOverview tests Handles undefined commonsFeatures safely for ordinary users
statusReason: Cannot read properties of undefined (reading 'FARMERS_CAN_SEE_LEADERBOARD')

[Killed] ConditionalExpression
main/components/Commons/CommonsOverview.jsx:55:14
             <Card.Text>Total Players: {commonsPlus.totalUsers}</Card.Text>
           </Col>
           <Col>
-            {showLeaderboard && (
-              <Button
-                variant="outline-success"
-                data-testid="user-leaderboard-button"
-                onClick={leaderboardButtonClick}
-              >
-                Leaderboard
-              </Button>
-            )}
+            {true}
           </Col>
         </Row>
killedBy: CommonsOverview tests Redirects to the LeaderboardPage for an admin when you click visit
statusReason: Unable to find an element by: [data-testid="user-leaderboard-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="card"
      data-testid="CommonsOverview"
