[Killed] ObjectLiteral
src/main/pages/AdminEditCommonsPage.jsx:23:15
       // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
       method: "GET",
       url: `/api/commons`,
-      params: {
-        id,
-      },
+      params: {},
     },
   );
killedBy: AdminEditCommonsPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find a label with the text of: /Commons Name/

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
src/main/pages/AdminEditCommonsPage.jsx:29:34
     },
   );
 
-  const objectToAxiosPutParams = (commons) => ({
-    url: "/api/commons/update",
-    method: "PUT",
-    params: {
-      id: commons.id,
-    },
-    data: {
-      name: commons.name,
-      startingBalance: commons.startingBalance,
-      cowPrice: commons.cowPrice,
-      milkPrice: commons.milkPrice,
-      startingDate: commons.startingDate,
-      lastDate: commons.lastDate,
-      degradationRate: commons.degradationRate,
-      capacityPerUser: commons.capacityPerUser,
-      carryingCapacity: commons.carryingCapacity,
-      aboveCapacityHealthUpdateStrategy:
-        commons.aboveCapacityHealthUpdateStrategy,
-      belowCapacityHealthUpdateStrategy:
-        commons.belowCapacityHealthUpdateStrategy,
-      hidden: commons.hidden,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const {
killedBy: AdminEditCommonsPage tests tests where backend is working normally Changes when you click Update
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
src/main/pages/AdminEditCommonsPage.jsx:30:10
   );
 
   const objectToAxiosPutParams = (commons) => ({
-    url: "/api/commons/update",
+    url: "",
     method: "PUT",
     params: {
killedBy: AdminEditCommonsPage tests tests where backend is working normally Changes when you click Update
statusReason: Found a label with the text of: /When above capacity/, however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
src/main/pages/AdminEditCommonsPage.jsx:58:6
     _error: _commonsFeaturesError,
     _status: _commonsFeaturesStatus,
   } = useBackend(
-    [`/api/commonsfeatures?commonsId=${id}`],
+    [``],
     {
       method: "GET",
killedBy: AdminEditCommonsPage tests tests where backend is working normally Calls useBackend and useBackendMutation with expected commons features args
statusReason: expected undefined to be defined

[Killed] ObjectLiteral
src/main/pages/AdminEditCommonsPage.jsx:59:5
     _status: _commonsFeaturesStatus,
   } = useBackend(
     [`/api/commonsfeatures?commonsId=${id}`],
-    {
-      method: "GET",
-      url: "/api/commonsfeatures",
-      params: {
-        commonsId: id,
-      },
-    },
+    {},
     {},
   );
killedBy: AdminEditCommonsPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="CommonsFeaturesForm-FARMERS_CAN_SEE_LEADERBOARD"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
src/main/pages/AdminEditCommonsPage.jsx:69:46
     {},
   );
 
-  const commonsFeaturesObjectToAxiosParams = (features) => ({
-    url: "/api/commonsfeatures",
-    method: "POST",
-    data: {
-      commonsId: id,
-      ...features,
-    },
-  });
+  const commonsFeaturesObjectToAxiosParams = () => undefined;
 
   const commonsFeaturesMutation = useBackendMutation(
killedBy: AdminEditCommonsPage tests tests where backend is working normally Updates commons features when form is submitted
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
src/main/pages/AdminEditCommonsPage.jsx:70:10
   );
 
   const commonsFeaturesObjectToAxiosParams = (features) => ({
-    url: "/api/commonsfeatures",
+    url: "",
     method: "POST",
     data: {
killedBy: AdminEditCommonsPage tests tests where backend is working normally Updates commons features when form is submitted
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
src/main/pages/AdminEditCommonsPage.jsx:81:24
   const commonsFeaturesMutation = useBackendMutation(
     commonsFeaturesObjectToAxiosParams,
     {
-      onSuccess: () => {
-        toast("Commons features updated successfully");
-      },
+      onSuccess: () => {},
     },
     [`/api/commonsfeatures?commonsId=${id}`],
killedBy: AdminEditCommonsPage tests tests where backend is working normally Updates commons features when form is submitted
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ArrayDeclaration
src/main/pages/AdminEditCommonsPage.jsx:85:5
         toast("Commons features updated successfully");
       },
     },
-    [`/api/commonsfeatures?commonsId=${id}`],
+    [],
   );
 
killedBy: AdminEditCommonsPage tests tests where backend is working normally Calls useBackend and useBackendMutation with expected commons features args
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/main/pages/AdminEditCommonsPage.jsx:88:55
     [`/api/commonsfeatures?commonsId=${id}`],
   );
 
-  const commonsFeaturesSubmitAction = async (data) => {
-    commonsFeaturesMutation.mutate(data);
-  };
+  const commonsFeaturesSubmitAction = async (data) => {};
 
   const onSuccess = (_, commons) => {
killedBy: AdminEditCommonsPage tests tests where backend is working normally Updates commons features when form is submitted
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] LogicalOperator
src/main/pages/AdminEditCommonsPage.jsx:124:10
             buttonLabel="Update"
           />
         )}
-        {commonsFeatures && (
-          <>
-            <div className="border-bottom mb-4"></div>
-            <h2>Commons Feature Flags</h2>
-            <CommonsFeaturesForm
-              features={commonsFeatures}
-              onSubmit={commonsFeaturesSubmitAction}
-              buttonLabel="Save Commons Features"
-            />
-          </>
-        )}
+        {commonsFeatures || <>
+            <div className="border-bottom mb-4"></div>
+            <h2>Commons Feature Flags</h2>
+            <CommonsFeaturesForm features={commonsFeatures} onSubmit={commonsFeaturesSubmitAction} buttonLabel="Save Commons Features" />
+          </>}
       </div>
     </BasicLayout>
killedBy: AdminEditCommonsPage tests tests where backend is working normally renders without crashing
statusReason: Objects are not valid as a React child (found: object with keys {}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
src/main/pages/AdminEditCommonsPage.jsx:124:10
             buttonLabel="Update"
           />
         )}
-        {commonsFeatures && (
-          <>
-            <div className="border-bottom mb-4"></div>
-            <h2>Commons Feature Flags</h2>
-            <CommonsFeaturesForm
-              features={commonsFeatures}
-              onSubmit={commonsFeaturesSubmitAction}
-              buttonLabel="Save Commons Features"
-            />
-          </>
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: AdminEditCommonsPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="CommonsFeaturesForm-FARMERS_CAN_SEE_LEADERBOARD"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
