[Killed] ObjectLiteral
src/main/pages/PlayPage.jsx:65:5
     status: _commonsFeaturesStatus,
   } = useBackend(
     [`/api/commonsfeatures?commonsId=${commonsId}`],
-    {
-      method: "GET",
-      url: "/api/commonsfeatures",
-      params: {
-        commonsId: commonsId,
-      },
-    },
+    {},
     {},
   );
killedBy: PlayPage tests renders without crashing
statusReason: Unable to find an element by: [data-testid="playpage-chat-div"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(/src/assets/PlayPageBackground.jpg);"

[Killed] StringLiteral
src/main/pages/PlayPage.jsx:67:12
     [`/api/commonsfeatures?commonsId=${commonsId}`],
     {
       method: "GET",
-      url: "/api/commonsfeatures",
+      url: "",
       params: {
         commonsId: commonsId,
killedBy: PlayPage tests renders without crashing
statusReason: Unable to find an element by: [data-testid="playpage-chat-div"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(/src/assets/PlayPageBackground.jpg);"

[Killed] ObjectLiteral
src/main/pages/PlayPage.jsx:68:15
     {
       method: "GET",
       url: "/api/commonsfeatures",
-      params: {
-        commonsId: commonsId,
-      },
+      params: {},
     },
     {},
killedBy: PlayPage tests renders without crashing
statusReason: Unable to find an element by: [data-testid="playpage-chat-div"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(/src/assets/PlayPageBackground.jpg);"

[Killed] BooleanLiteral
src/main/pages/PlayPage.jsx:75:29
     {},
   );
 
-  const commonsPlusExists = !(typeof commonsPlus == "undefined");
+  const commonsPlusExists = typeof commonsPlus == "undefined";
   let commonsforuser;
   let matched;
killedBy: PlayPage tests renders without crashing
statusReason: Cannot read properties of null (reading 'user')

[Killed] BlockStatement
src/main/pages/PlayPage.jsx:79:26
   let commonsforuser;
   let matched;
 
-  if (commonsPlusExists) {
-    commonsforuser = currentUser.root.user.commons;
-    matched = commonsforuser.some((com) => com.id === commonsPlus.commons.id);
-  }
+  if (commonsPlusExists) {}
 
   const allowed = commonsPlusExists && matched && !commonsPlus.commons.hidden;
killedBy: PlayPage tests renders without crashing
statusReason: Unable to find an element by: [data-testid="commonsPlay-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(/src/assets/PlayPageBackground.jpg);"

[Killed] ArrowFunction
src/main/pages/PlayPage.jsx:81:35
 
   if (commonsPlusExists) {
     commonsforuser = currentUser.root.user.commons;
-    matched = commonsforuser.some((com) => com.id === commonsPlus.commons.id);
+    matched = commonsforuser.some(() => undefined);
   }
 
killedBy: PlayPage tests renders without crashing
statusReason: Unable to find an element by: [data-testid="commonsPlay-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(/src/assets/PlayPageBackground.jpg);"

[Killed] ConditionalExpression
src/main/pages/PlayPage.jsx:84:19
     matched = commonsforuser.some((com) => com.id === commonsPlus.commons.id);
   }
 
-  const allowed = commonsPlusExists && matched && !commonsPlus.commons.hidden;
+  const allowed = true && !commonsPlus.commons.hidden;
   const notallowed = commonsPlusExists && !matched;
   const hidden = commonsPlusExists && commonsPlus.commons.hidden;
killedBy: PlayPage tests renders without crashing
statusReason: Cannot read properties of undefined (reading 'commons')

[Killed] BooleanLiteral
src/main/pages/PlayPage.jsx:85:43
   }
 
   const allowed = commonsPlusExists && matched && !commonsPlus.commons.hidden;
-  const notallowed = commonsPlusExists && !matched;
+  const notallowed = commonsPlusExists && matched;
   const hidden = commonsPlusExists && commonsPlus.commons.hidden;
 
killedBy: PlayPage tests User that has joined one commons is trying to access an unjoined common
statusReason: Unable to find an element with the text: You have yet to join this commons!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>

[Killed] ConditionalExpression
src/main/pages/PlayPage.jsx:86:18
 
   const allowed = commonsPlusExists && matched && !commonsPlus.commons.hidden;
   const notallowed = commonsPlusExists && !matched;
-  const hidden = commonsPlusExists && commonsPlus.commons.hidden;
+  const hidden = false;
 
   // Stryker disable all
killedBy: PlayPage tests cannot join hidden commons
statusReason: Unable to find an element with the text: This commons has been hidden by the site administrator.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; bac

[Killed] StringLiteral
src/main/pages/PlayPage.jsx:173:13
   const chatContainerStyle = {
     width: "550px",
     position: "fixed",
-    bottom: "100px",
+    bottom: "",
     right: "20px",
   };
killedBy: PlayPage tests Chat button and container have correct styles
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- bottom: 100px;
  position: fixed;
  right: 20px;

[Killed] ObjectLiteral
src/main/pages/PlayPage.jsx:177:22
     right: "20px",
   };
 
-  const emojiStyle = {
-    fontFamily: "Arial, sans-serif",
-    fontSize: "30px",
-  };
+  const emojiStyle = {};
 
   return (
killedBy: PlayPage tests Chat button and container have correct styles
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- font-family: Arial, sans-serif;

[Killed] BooleanLiteral
src/main/pages/PlayPage.jsx:192:12
     >
       <BasicLayout>
         <Container>
-          {!commonsPlus && <h1>This commons does not exist!</h1>}
+          {commonsPlus && <h1>This commons does not exist!</h1>}
           {notallowed && <h1>You have yet to join this commons!</h1>}
           {hidden && (
killedBy: PlayPage tests click buy button
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <h1>
  This commons does not exist!
</h1> instead

[Killed] ConditionalExpression
src/main/pages/PlayPage.jsx:194:12
         <Container>
           {!commonsPlus && <h1>This commons does not exist!</h1>}
           {notallowed && <h1>You have yet to join this commons!</h1>}
-          {hidden && (
-            <h1>This commons has been hidden by the site administrator.</h1>
-          )}
+          {false}
           {allowed && !!currentUser && (
             <CommonsPlay currentUser={currentUser} />
killedBy: PlayPage tests cannot join hidden commons
statusReason: Unable to find an element with the text: This commons has been hidden by the site administrator.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; bac

[Killed] BooleanLiteral
src/main/pages/PlayPage.jsx:197:24
           {hidden && (
             <h1>This commons has been hidden by the site administrator.</h1>
           )}
-          {allowed && !!currentUser && (
+          {allowed && !currentUser && (
             <CommonsPlay currentUser={currentUser} />
           )}
killedBy: PlayPage tests renders without crashing
statusReason: Unable to find an element by: [data-testid="commonsPlay-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(/src/assets/PlayPageBackground.jpg);"

[Killed] LogicalOperator
src/main/pages/PlayPage.jsx:201:12
             <CommonsPlay currentUser={currentUser} />
           )}
 
-          {allowed && !!commonsPlus && (
+          {allowed || !!commonsPlus && (
             <CommonsOverview
               commonsPlus={commonsPlus}
killedBy: PlayPage tests cannot join hidden commons
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="card"
  data-testid="CommonsOverview"
>
  <h5
    class="woodenboardtable card-header"

[Killed] BooleanLiteral
src/main/pages/PlayPage.jsx:208:23
             />
           )}
           <br />
-          {allowed && !!userCommons && !!commonsPlus && (
+          {allowed && !userCommons && !!commonsPlus && (
             <CardGroup>
               <ManageCows
killedBy: PlayPage tests renders without crashing
statusReason: Unable to find an element by: [data-testid="ManageCows"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(/src/assets/PlayPageBackground.jpg);"

[Killed] LogicalOperator
src/main/pages/PlayPage.jsx:208:12
             />
           )}
           <br />
-          {allowed && !!userCommons && !!commonsPlus && (
+          {allowed || !!userCommons && !!commonsPlus && (
             <CardGroup>
               <ManageCows
killedBy: PlayPage tests cannot join hidden commons
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="card"
  data-testid="ManageCows"
>
  <h5
    class="woodenboardtable card-header"

[Killed] ConditionalExpression
src/main/pages/PlayPage.jsx:232:8
           )}
         </Container>
       </BasicLayout>
-      {(hasRole(currentUser, "ROLE_ADMIN") ||
-        (allowed && !!commonsPlus && commonsFeatures?.SHOW_CHAT)) && (
-        <div style={chatContainerStyle} data-testid="playpage-chat-div">
-          {!!isChatOpen && <ChatPanel commonsId={commonsId} />}
-          <Button
-            style={chatButtonStyle}
-            onClick={toggleChatWindow}
-            data-testid="playpage-chat-toggle"
-          >
-            {isChatOpen ? (
-              <span style={emojiStyle} data-testid="close-icon">
-                ❌
-              </span>
-            ) : (
-              <span style={emojiStyle} data-testid="message-icon">
-                💬
-              </span>
-            )}
-          </Button>
-        </div>
-      )}
+      {true}
     </div>
   );
killedBy: PlayPage tests renders without crashing
statusReason: Unable to find an element by: [data-testid="playpage-chat-div"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(/src/assets/PlayPageBackground.jpg);"

[Killed] LogicalOperator
src/main/pages/PlayPage.jsx:232:8
           )}
         </Container>
       </BasicLayout>
-      {(hasRole(currentUser, "ROLE_ADMIN") ||
-        (allowed && !!commonsPlus && commonsFeatures?.SHOW_CHAT)) && (
-        <div style={chatContainerStyle} data-testid="playpage-chat-div">
-          {!!isChatOpen && <ChatPanel commonsId={commonsId} />}
-          <Button
-            style={chatButtonStyle}
-            onClick={toggleChatWindow}
-            data-testid="playpage-chat-toggle"
-          >
-            {isChatOpen ? (
-              <span style={emojiStyle} data-testid="close-icon">
-                ❌
-              </span>
-            ) : (
-              <span style={emojiStyle} data-testid="message-icon">
-                💬
-              </span>
-            )}
-          </Button>
-        </div>
-      )}
+      {hasRole(currentUser, "ROLE_ADMIN") || allowed && !!commonsPlus && commonsFeatures?.SHOW_CHAT || <div style={chatContainerStyle} data-testid="playpage-chat-div">
+          {!!isChatOpen && <ChatPanel commonsId={commonsId} />}
+          <Button style={chatButtonStyle} onClick={toggleChatWindow} data-testid="playpage-chat-toggle">
+            {isChatOpen ? <span style={emojiStyle} data-testid="close-icon">
+                ❌
+              </span> : <span style={emojiStyle} data-testid="message-icon">
+                💬
+              </span>}
+          </Button>
+        </div>}
     </div>
   );
killedBy: PlayPage tests renders without crashing
statusReason: Unable to find an element by: [data-testid="playpage-chat-div"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(/src/assets/PlayPageBackground.jpg);"

[Killed] LogicalOperator
src/main/pages/PlayPage.jsx:233:10
         </Container>
       </BasicLayout>
       {(hasRole(currentUser, "ROLE_ADMIN") ||
-        (allowed && !!commonsPlus && commonsFeatures?.SHOW_CHAT)) && (
+        (allowed && !!commonsPlus || commonsFeatures?.SHOW_CHAT)) && (
         <div style={chatContainerStyle} data-testid="playpage-chat-div">
           {!!isChatOpen && <ChatPanel commonsId={commonsId} />}
killedBy: PlayPage tests cannot join hidden commons
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  data-testid="playpage-chat-div"
  style="width: 550px; position: fixed; bottom: 100px; right: 20px;"
>
  <button
    class="btn btn-primary"

[Killed] LogicalOperator
src/main/pages/PlayPage.jsx:233:10
         </Container>
       </BasicLayout>
       {(hasRole(currentUser, "ROLE_ADMIN") ||
-        (allowed && !!commonsPlus && commonsFeatures?.SHOW_CHAT)) && (
+        (allowed || !!commonsPlus && commonsFeatures?.SHOW_CHAT)) && (
         <div style={chatContainerStyle} data-testid="playpage-chat-div">
           {!!isChatOpen && <ChatPanel commonsId={commonsId} />}
killedBy: PlayPage tests cannot join hidden commons
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  data-testid="playpage-chat-div"
  style="width: 550px; position: fixed; bottom: 100px; right: 20px;"
>
  <button
    class="btn btn-primary"
