[Killed] StringLiteral
main/components/Commons/CommonsTable.jsx:117:17
           Tot <br /> Cows
         </span>
       ),
-      accessor: "totalCows",
+      accessor: "",
     },
     {
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Commons/CommonsTable.jsx:143:17
           Eff <br /> Cap
         </span>
       ),
-      accessor: "effectiveCapacity",
+      accessor: "",
     },
   ];
killedBy: AdminListCommonPage tests renders without crashing for regular user
statusReason: A column ID (or string accessor) is required!

[Killed] ArrayDeclaration
main/components/Commons/CommonsTable.jsx:149:26
 
   const testid = "CommonsTable";
 
-  const columnsIfAdmin = [
-    ...columns,
-    ButtonColumn("Edit", "primary", editCallback, testid),
-    ButtonColumn("Delete", "danger", deleteCallback, testid),
-    ButtonColumn("Leaderboard", "secondary", leaderboardCallback, testid),
-    HrefButtonColumn(
-      "Stats CSV",
-      "success",
-      `/api/commonstats/download?commonsId=`,
-      testid,
-    ),
-    HrefButtonColumn("Announcements", "info", `/admin/announcements/`, testid),
-  ];
+  const columnsIfAdmin = [];
 
   const columnsToDisplay = hasRole(currentUser, "ROLE_ADMIN")
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] StringLiteral
main/components/Commons/CommonsTable.jsx:153:18
     ...columns,
     ButtonColumn("Edit", "primary", editCallback, testid),
     ButtonColumn("Delete", "danger", deleteCallback, testid),
-    ButtonColumn("Leaderboard", "secondary", leaderboardCallback, testid),
+    ButtonColumn("", "secondary", leaderboardCallback, testid),
     HrefButtonColumn(
       "Stats CSV",
killedBy: UserTable tests renders without crashing for empty table for admin
statusReason: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Commons/CommonsTable.jsx:160:47
       `/api/commonstats/download?commonsId=`,
       testid,
     ),
-    HrefButtonColumn("Announcements", "info", `/admin/announcements/`, testid),
+    HrefButtonColumn("Announcements", "info", ``, testid),
   ];
 
killedBy: AdminAnnouncementsPage tests correct href for announcements button as an admin
statusReason: expect(element).toHaveAttribute("href", "/admin/announcements/1") // element.getAttribute("href") === "/admin/announcements/1"

Expected the element to have attribute:
  href="/admin/announcements/1"
Received:
  href="1"

[Killed] StringLiteral
main/components/Commons/CommonsTable.jsx:160:39
       `/api/commonstats/download?commonsId=`,
       testid,
     ),
-    HrefButtonColumn("Announcements", "info", `/admin/announcements/`, testid),
+    HrefButtonColumn("Announcements", "", `/admin/announcements/`, testid),
   ];
 
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: expect(element).toHaveClass("btn-info")

Expected the element to have class:
  btn-info
Received:
  btn

[Killed] ConditionalExpression
main/components/Commons/CommonsTable.jsx:199:8
   return (
     <>
       <OurTable data={commons} columns={columnsToDisplay} testid={testid} />
-      {hasRole(currentUser, "ROLE_ADMIN") && commonsModal}
+      {true}
     </>
   );
killedBy: AdminListCommonPage tests what happens when you click delete, admin
statusReason: Unable to find an element by: [data-testid="CommonsTable-Modal-Delete"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
