[Killed] BlockStatement
main/components/Jobs/InstructorReportSpecificCommonsForm.jsx:19:19
   const [selectedCommons, setSelectedCommons] = useState(null);
   const [selectedCommonsName, setSelectedCommonsName] = useState(null);
 
-  useEffect(() => {
-    if (commons && commons.length > 0 && selectedCommons === null) {
-      setSelectedCommons(commons[0].id);
-      setSelectedCommonsName(commons[0].name);
-    }
-  }, [commons, selectedCommons]);
+  useEffect(() => {}, [commons, selectedCommons]);
 
   const {
killedBy: InstructorReportSpecificCommonsForm tests the first item in commons array is selected by default
statusReason: expect(element).toBeChecked()

Received element is not checked:
  <input
  class="form-check-input"
  data-testid="InstructorReportSpecificCommonsForm-commons-5"
  type="radio"
/>

[Killed] LogicalOperator
main/components/Jobs/InstructorReportSpecificCommonsForm.jsx:20:9
   const [selectedCommonsName, setSelectedCommonsName] = useState(null);
 
   useEffect(() => {
-    if (commons && commons.length > 0 && selectedCommons === null) {
+    if (commons || commons.length > 0 && selectedCommons === null) {
       setSelectedCommons(commons[0].id);
       setSelectedCommonsName(commons[0].name);
killedBy: InstructorReportSpecificCommonsForm tests renders the fallback text correctlyl
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] EqualityOperator
main/components/Jobs/InstructorReportSpecificCommonsForm.jsx:20:42
   const [selectedCommonsName, setSelectedCommonsName] = useState(null);
 
   useEffect(() => {
-    if (commons && commons.length > 0 && selectedCommons === null) {
+    if (commons && commons.length > 0 && selectedCommons !== null) {
       setSelectedCommons(commons[0].id);
       setSelectedCommonsName(commons[0].name);
killedBy: InstructorReportSpecificCommonsForm tests user can sucessfully submit the job
statusReason: expected "spy" to be called with arguments: [ { selectedCommons: 1, …(1) } ]

Received: 

  1st spy call:

  [
    {

[Killed] ConditionalExpression
main/components/Jobs/InstructorReportSpecificCommonsForm.jsx:41:7
     submitAction(params);
   };
 
-  if (!commons || commons.length === 0) {
+  if (true) {
     return <div>There are no commons on which to run this job.</div>;
   }
killedBy: InstructorReportSpecificCommonsForm tests user can sucessfully submit the job
statusReason: Unable to find an element by: [data-testid="InstructorReportSpecificCommonsForm-commons-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      There are no commons on which to run this job.
    </div>
