[Killed] ConditionalExpression
main/components/Jobs/MilkCowsJobForm.jsx:17:40
   );
 
   const allCommonsProp = { id: 0, name: "All Commons" };
-  const commons = [allCommonsProp, ...(commonsAll || [])];
+  const commons = [allCommonsProp, ...(false)];
 
   const [selectedCommons, setSelectedCommons] = useState(null);
killedBy: MilkTheCowsForm tests user can sucessfully submit the job
statusReason: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value) is not iterable

[Killed] ConditionalExpression
main/components/Jobs/MilkCowsJobForm.jsx:17:40
   );
 
   const allCommonsProp = { id: 0, name: "All Commons" };
-  const commons = [allCommonsProp, ...(commonsAll || [])];
+  const commons = [allCommonsProp, ...(true)];
 
   const [selectedCommons, setSelectedCommons] = useState(null);
killedBy: MilkTheCowsForm tests user can sucessfully submit the job
statusReason: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value) is not iterable

[Killed] BlockStatement
main/components/Jobs/MilkCowsJobForm.jsx:22:19
   const [selectedCommons, setSelectedCommons] = useState(null);
   const [selectedCommonsName, setSelectedCommonsName] = useState(null);
 
-  useEffect(() => {
-    if (commons.length > 0 && selectedCommons === null) {
-      setSelectedCommons(commons[0].id);
-      setSelectedCommonsName(commons[0].name);
-    }
-  }, [commons, selectedCommons]);
+  useEffect(() => {}, [commons, selectedCommons]);
 
   const { handleSubmit } = useForm();
killedBy: MilkTheCowsForm tests the first item in commons array is selected by default
statusReason: expect(element).toBeChecked()

Received element is not checked:
  <input
  class="form-check-input"
  data-testid="MilkTheCowsForm-commons-0"
  type="radio"
/>

[Killed] EqualityOperator
main/components/Jobs/MilkCowsJobForm.jsx:23:9
   const [selectedCommonsName, setSelectedCommonsName] = useState(null);
 
   useEffect(() => {
-    if (commons.length > 0 && selectedCommons === null) {
+    if (commons.length <= 0 && selectedCommons === null) {
       setSelectedCommons(commons[0].id);
       setSelectedCommonsName(commons[0].name);
killedBy: MilkTheCowsForm tests the first item in commons array is selected by default
statusReason: expect(element).toBeChecked()

Received element is not checked:
  <input
  class="form-check-input"
  data-testid="MilkTheCowsForm-commons-0"
  type="radio"
/>

[Killed] ConditionalExpression
main/components/Jobs/MilkCowsJobForm.jsx:23:9
   const [selectedCommonsName, setSelectedCommonsName] = useState(null);
 
   useEffect(() => {
-    if (commons.length > 0 && selectedCommons === null) {
+    if (true) {
       setSelectedCommons(commons[0].id);
       setSelectedCommonsName(commons[0].name);
killedBy: AdminJobsPage tests user can submit milk the cows job
statusReason: expected '/api/jobs/launch/milkthecowjob' to be '/api/jobs/launch/milkthecowjobsinglec…' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div
