[Killed] BlockStatement
main/components/Jobs/SetCowHealthForm.jsx:11:32
   submitAction = () => {},
   testid = "SetCowHealthForm",
 }) {
-  const getSavedHealth = () => {
-    if (
-      typeof window !== "undefined" &&
-      window.localStorage &&
-      typeof window.localStorage.getItem === "function"
-    ) {
-      return window.localStorage.getItem(`${testid}-health`);
-    }
-    return null;
-  };
+  const getSavedHealth = () => {};
 
   const [healthValue, setHealthValue] = useState(100);
killedBy: AdminJobsPage tests user can submit a set cow health job
statusReason: Cannot read properties of undefined (reading 'url')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ConditionalExpression
main/components/Jobs/SetCowHealthForm.jsx:13:7
 }) {
   const getSavedHealth = () => {
     if (
-      typeof window !== "undefined" &&
-      window.localStorage &&
-      typeof window.localStorage.getItem === "function"
+      false
     ) {
       return window.localStorage.getItem(`${testid}-health`);
killedBy: SetCowHealthForm tests healthValue can be loaded from localstorage
statusReason: expect(element).toHaveValue(42)

Expected the element to have value:
  42
Received:
  100

Ignored nodes: comments, script, style

[Killed] EqualityOperator
main/components/Jobs/SetCowHealthForm.jsx:13:7
 }) {
   const getSavedHealth = () => {
     if (
-      typeof window !== "undefined" &&
+      typeof window === "undefined" &&
       window.localStorage &&
       typeof window.localStorage.getItem === "function"
killedBy: SetCowHealthForm tests healthValue can be loaded from localstorage
statusReason: expect(element).toHaveValue(42)

Expected the element to have value:
  42
Received:
  100

Ignored nodes: comments, script, style

[Killed] EqualityOperator
main/components/Jobs/SetCowHealthForm.jsx:15:7
     if (
       typeof window !== "undefined" &&
       window.localStorage &&
-      typeof window.localStorage.getItem === "function"
+      typeof window.localStorage.getItem !== "function"
     ) {
       return window.localStorage.getItem(`${testid}-health`);
killedBy: SetCowHealthForm tests healthValue can be loaded from localstorage
statusReason: expect(element).toHaveValue(42)

Expected the element to have value:
  42
Received:
  100

Ignored nodes: comments, script, style

[Survived] ConditionalExpression
main/components/Jobs/SetCowHealthForm.jsx:15:7
     if (
       typeof window !== "undefined" &&
       window.localStorage &&
-      typeof window.localStorage.getItem === "function"
+      true
     ) {
       return window.localStorage.getItem(`${testid}-health`);

[Killed] BlockStatement
main/components/Jobs/SetCowHealthForm.jsx:16:7
       typeof window !== "undefined" &&
       window.localStorage &&
       typeof window.localStorage.getItem === "function"
-    ) {
-      return window.localStorage.getItem(`${testid}-health`);
-    }
+    ) {}
     return null;
   };
killedBy: SetCowHealthForm tests healthValue can be loaded from localstorage
statusReason: expect(element).toHaveValue(42)

Expected the element to have value:
  42
Received:
  100

Ignored nodes: comments, script, style

[Killed] BlockStatement
main/components/Jobs/SetCowHealthForm.jsx:24:19
 
   const [healthValue, setHealthValue] = useState(100);
 
-  useEffect(() => {
-    const savedHealth = getSavedHealth();
-    if (savedHealth !== null) {
-      setHealthValue(savedHealth);
-    }
-  }, [testid]);
+  useEffect(() => {}, [testid]);
 
   const { data: commons } = useBackend(
killedBy: SetCowHealthForm tests healthValue can be loaded from localstorage
statusReason: expect(element).toHaveValue(42)

Expected the element to have value:
  42
Received:
  100

Ignored nodes: comments, script, style

[Killed] EqualityOperator
main/components/Jobs/SetCowHealthForm.jsx:26:9
 
   useEffect(() => {
     const savedHealth = getSavedHealth();
-    if (savedHealth !== null) {
+    if (savedHealth === null) {
       setHealthValue(savedHealth);
     }
killedBy: SetCowHealthForm tests validates health > 0
statusReason: expect(element).toHaveValue(100)

Expected the element to have value:
  100
Received:
  null

[Killed] BlockStatement
main/components/Jobs/SetCowHealthForm.jsx:26:31
 
   useEffect(() => {
     const savedHealth = getSavedHealth();
-    if (savedHealth !== null) {
-      setHealthValue(savedHealth);
-    }
+    if (savedHealth !== null) {}
   }, [testid]);
 
killedBy: SetCowHealthForm tests healthValue can be loaded from localstorage
statusReason: expect(element).toHaveValue(42)

Expected the element to have value:
  42
Received:
  100

Ignored nodes: comments, script, style

[Killed] StringLiteral
main/components/Jobs/SetCowHealthForm.jsx:32:6
   }, [testid]);
 
   const { data: commons } = useBackend(
-    ["/api/commons/all"],
+    [""],
     { url: "/api/commons/all" },
     [],
killedBy: SetCowHealthForm tests the correct parameters are passed to useBackend
statusReason: expected "useBackend" to be called with arguments: [ [ '/api/commons/all' ], …(2) ]

Received: 

  1st useBackend call:

@@ -1,8 +1,8 @@
  [

[Killed] ConditionalExpression
main/components/Jobs/SetCowHealthForm.jsx:41:42
   const [selectedCommonsName, setSelectedCommonsName] = useState(null);
 
   useEffect(() => {
-    if (commons && commons.length > 0 && selectedCommons === null) {
+    if (commons && commons.length > 0 && true) {
       setSelectedCommons(commons[0].id);
       setSelectedCommonsName(commons[0].name);
killedBy: SetCowHealthForm tests user can sucessfully submit the job
statusReason: expected "spy" to be called with arguments: [ { healthValue: '10', …(2) } ]

Received: 

  1st spy call:

  [
    {

[Killed] ConditionalExpression
main/components/Jobs/SetCowHealthForm.jsx:41:20
   const [selectedCommonsName, setSelectedCommonsName] = useState(null);
 
   useEffect(() => {
-    if (commons && commons.length > 0 && selectedCommons === null) {
+    if (commons && true && selectedCommons === null) {
       setSelectedCommons(commons[0].id);
       setSelectedCommonsName(commons[0].name);
killedBy: AdminJobsPage tests renders without crashing
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] BlockStatement
main/components/Jobs/SetCowHealthForm.jsx:53:42
     formState: { errors },
   } = useForm();
 
-  const handleHealthValueChange = (e) => {
-    const newValue = e.target.value;
-    setHealthValue(newValue);
-    if (
-      typeof window !== "undefined" &&
-      window.localStorage &&
-      typeof window.localStorage.setItem === "function"
-    ) {
-      window.localStorage.setItem(`${testid}-health`, newValue);
-    }
-  };
+  const handleHealthValueChange = (e) => {};
 
   const handleCommonsSelection = (id, name) => {
killedBy: SetCowHealthForm tests validates health > 0
statusReason: Unable to find an element with the text: /Health Value must be ≥ 0/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/Jobs/SetCowHealthForm.jsx:57:7
     const newValue = e.target.value;
     setHealthValue(newValue);
     if (
-      typeof window !== "undefined" &&
-      window.localStorage &&
-      typeof window.localStorage.setItem === "function"
+      false
     ) {
       window.localStorage.setItem(`${testid}-health`, newValue);
killedBy: SetCowHealthForm tests healthValue is saved in localstorage
statusReason: expected "spy" to be called with arguments: [ 'SetCowHealthForm-health', '24' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] EqualityOperator
main/components/Jobs/SetCowHealthForm.jsx:59:7
     if (
       typeof window !== "undefined" &&
       window.localStorage &&
-      typeof window.localStorage.setItem === "function"
+      typeof window.localStorage.setItem !== "function"
     ) {
       window.localStorage.setItem(`${testid}-health`, newValue);
killedBy: SetCowHealthForm tests healthValue is saved in localstorage
statusReason: expected "spy" to be called with arguments: [ 'SetCowHealthForm-health', '24' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Survived] ConditionalExpression
main/components/Jobs/SetCowHealthForm.jsx:59:7
     if (
       typeof window !== "undefined" &&
       window.localStorage &&
-      typeof window.localStorage.setItem === "function"
+      true
     ) {
       window.localStorage.setItem(`${testid}-health`, newValue);

[Killed] BlockStatement
main/components/Jobs/SetCowHealthForm.jsx:60:7
       typeof window !== "undefined" &&
       window.localStorage &&
       typeof window.localStorage.setItem === "function"
-    ) {
-      window.localStorage.setItem(`${testid}-health`, newValue);
-    }
+    ) {}
   };
 
killedBy: SetCowHealthForm tests healthValue is saved in localstorage
statusReason: expected "spy" to be called with arguments: [ 'SetCowHealthForm-health', '24' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/Jobs/SetCowHealthForm.jsx:61:35
       window.localStorage &&
       typeof window.localStorage.setItem === "function"
     ) {
-      window.localStorage.setItem(`${testid}-health`, newValue);
+      window.localStorage.setItem(``, newValue);
     }
   };
killedBy: SetCowHealthForm tests healthValue is saved in localstorage
statusReason: expected "spy" to be called with arguments: [ 'SetCowHealthForm-health', '24' ]

Received: 

  1st spy call:

  [
-   "SetCowHealthForm-health",

[Killed] ObjectLiteral
main/components/Jobs/SetCowHealthForm.jsx:71:20
   };
 
   const onSubmit = () => {
-    const params = { selectedCommons, healthValue, selectedCommonsName };
+    const params = {};
     submitAction(params);
   };
killedBy: SetCowHealthForm tests user can sucessfully submit the job
statusReason: expected "spy" to be called with arguments: [ { healthValue: '10', …(2) } ]

Received: 

  1st spy call:

  [
-   {

[Killed] LogicalOperator
main/components/Jobs/SetCowHealthForm.jsx:75:7
     submitAction(params);
   };
 
-  if (!commons || commons.length === 0) {
+  if (!commons && commons.length === 0) {
     return <div>There are no commons on which to run this job.</div>;
   }
killedBy: SetCowHealthForm tests renders the fallback text correctlyl
statusReason: Unable to find an element with the text: There are no commons on which to run this job.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Jobs/SetCowHealthForm.jsx:103:23
           step="1"
           value={healthValue}
           {...register("healthValue", {
-            required: "Health Value is required",
+            required: "",
             min: { value: 0, message: "Health Value must be ≥ 0" },
             max: { value: 100, message: "Health Value must be ≤ 100" },
killedBy: SetCowHealthForm tests validates health is required
statusReason: Unable to find an element with the text: /Health Value is required/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Jobs/SetCowHealthForm.jsx:105:41
           {...register("healthValue", {
             required: "Health Value is required",
             min: { value: 0, message: "Health Value must be ≥ 0" },
-            max: { value: 100, message: "Health Value must be ≤ 100" },
+            max: { value: 100, message: "" },
           })}
           onChange={handleHealthValueChange}
killedBy: SetCowHealthForm tests validates health ≤ 100
statusReason: Unable to find an element with the text: /Health Value must be ≤ 100/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
