[Killed] LogicalOperator
main/components/Jobs/UpdateCowHealthForm.jsx:17:40
   );
 
   const allCommonsProp = { id: 0, name: "All Commons" };
-  const commons = [allCommonsProp, ...(commonsAll || [])];
+  const commons = [allCommonsProp, ...(commonsAll && [])];
 
   const [selectedCommons, setSelectedCommons] = useState(null);
killedBy: UpdateCowHealthForm tests user can sucessfully submit the job
statusReason: Unable to find an element by: [data-testid="UpdateCowHealthForm-commons-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/Jobs/UpdateCowHealthForm.jsx:23:31
   const [selectedCommonsName, setSelectedCommonsName] = useState(null);
 
   useEffect(() => {
-    if (commons.length > 0 && selectedCommons === null) {
+    if (commons.length > 0 && true) {
       setSelectedCommons(commons[0].id);
       setSelectedCommonsName(commons[0].name);
killedBy: AdminJobsPage tests user can submit update cow health job
statusReason: expected '/api/jobs/launch/updatecowhealth' to be '/api/jobs/launch/updatecowhealthsingl…' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
main/components/Jobs/UpdateCowHealthForm.jsx:37:20
   };
 
   const onSubmit = () => {
-    const params = { selectedCommons, selectedCommonsName };
+    const params = {};
     submitAction(params);
   };
killedBy: AdminJobsPage tests user can submit update cow health job
statusReason: expected '/api/jobs/launch/updatecowhealthsingl…' to be '/api/jobs/launch/updatecowhealthsingl…' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div
