[Killed] ObjectLiteral
main/components/Reports/ReportHeaderTable.jsx:38:5
       id: "startingDate",
       accessor: (row, _rowIndex) => String(row.startingDate).substring(0, 10),
     },
-    {
-      Header: "Leaderboard",
-      id: "showLeaderboard",
-      accessor: (row, _rowIndex) =>
-        String(row.FARMERS_CAN_SEE_LEADERBOARD ?? row.showLeaderboard), // support new feature flag or legacy field
-    },
+    {},
     {
       Header: "Capacity",
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Reports/ReportHeaderTable.jsx:41:17
     {
       Header: "Leaderboard",
       id: "showLeaderboard",
-      accessor: (row, _rowIndex) =>
-        String(row.FARMERS_CAN_SEE_LEADERBOARD ?? row.showLeaderboard), // support new feature flag or legacy field
+      accessor: () => undefined, // support new feature flag or legacy field
     },
     {
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  /true|false/
Received:

[Killed] LogicalOperator
main/components/Reports/ReportHeaderTable.jsx:42:16
       Header: "Leaderboard",
       id: "showLeaderboard",
       accessor: (row, _rowIndex) =>
-        String(row.FARMERS_CAN_SEE_LEADERBOARD ?? row.showLeaderboard), // support new feature flag or legacy field
+        String(row.FARMERS_CAN_SEE_LEADERBOARD && row.showLeaderboard), // support new feature flag or legacy field
     },
     {
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  /true|false/
Received:
  undefined

[Killed] ObjectLiteral
main/components/Reports/ReportHeaderTable.jsx:44:5
       accessor: (row, _rowIndex) =>
         String(row.FARMERS_CAN_SEE_LEADERBOARD ?? row.showLeaderboard), // support new feature flag or legacy field
     },
-    {
-      Header: "Capacity",
-      accessor: "carryingCapacity",
-      Cell: (props) => {
-        return <div style={{ textAlign: "right" }}>{props.value}</div>;
-      },
-    },
+    {},
     {
       Header: "Degrad Rate",
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Reports/ReportHeaderTable.jsx:46:17
     },
     {
       Header: "Capacity",
-      accessor: "carryingCapacity",
+      accessor: "",
       Cell: (props) => {
         return <div style={{ textAlign: "right" }}>{props.value}</div>;
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: Unable to find an element by: [data-testid="ReportHeaderTable-header-carryingCapacity"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] ObjectLiteral
main/components/Reports/ReportHeaderTable.jsx:58:5
         return <div style={{ textAlign: "right" }}>{props.value}</div>;
       },
     },
-    {
-      Header: "BelowCap",
-      accessor: "belowCapacityHealthUpdateStrategy",
-    },
+    {},
     {
       Header: "AboveCap",
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: A column ID (or string accessor) is required!

[Killed] ArrayDeclaration
main/components/Reports/ReportHeaderTable.jsx:70:26
 
   const testid = "ReportHeaderTable";
 
-  return <OurTable data={[report]} columns={columns} testid={testid} />;
+  return <OurTable data={[]} columns={columns} testid={testid} />;
 }
 
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: Unable to find an element by: [data-testid="ReportHeaderTable-cell-row-0-col-cowPrice"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >
