[Killed] BlockStatement
src/main/utils/systemInfo.js:4:33
 import { useQuery } from "react-query";
 import axios from "axios";
 
-export function useSystemInfo() {
-  return useQuery(
-    "systemInfo",
-    async () => {
-      try {
-        const response = await axios.get("/api/systemInfo");
-        return response.data;
-      } catch (e) {
-        console.error("Error invoking axios.get: ", e);
-        if (e.response?.status === 404) {
-          return {};
-        }
-        throw e;
-      }
-    },
-    {
-      placeholderData: {
-        springH2ConsoleEnabled: false,
-        showSwaggerUILink: false,
-      },
-    },
-  );
-}
+export function useSystemInfo() {}
 
killedBy: PlayPage tests renders without crashing
statusReason: Cannot destructure property 'data' of '(0 , useSystemInfo)(...)' as it is undefined.

[Killed] BlockStatement
src/main/utils/systemInfo.js:7:17
 export function useSystemInfo() {
   return useQuery(
     "systemInfo",
-    async () => {
-      try {
-        const response = await axios.get("/api/systemInfo");
-        return response.data;
-      } catch (e) {
-        console.error("Error invoking axios.get: ", e);
-        if (e.response?.status === 404) {
-          return {};
-        }
-        throw e;
-      }
-    },
+    async () => {},
     {
       placeholderData: {
killedBy: LeaderboardPage tests renders leaderboard for users when showLeaderboard = true
statusReason: expected 3 to deeply equal 4

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
src/main/utils/systemInfo.js:11:19
       try {
         const response = await axios.get("/api/systemInfo");
         return response.data;
-      } catch (e) {
-        console.error("Error invoking axios.get: ", e);
-        if (e.response?.status === 404) {
-          return {};
-        }
-        throw e;
-      }
+      } catch (e) {}
     },
     {
killedBy: utils/systemInfo tests useSystemInfo tests systemInfo when API unreachable
statusReason: expected "error" to be called at least once

[Killed] BlockStatement
src/main/utils/systemInfo.js:13:41
         return response.data;
       } catch (e) {
         console.error("Error invoking axios.get: ", e);
-        if (e.response?.status === 404) {
-          return {};
-        }
+        if (e.response?.status === 404) {}
         throw e;
       }
killedBy: utils/systemInfo tests useSystemInfo tests systemInfo when API unreachable
statusReason: expected { springH2ConsoleEnabled: false, …(1) } to deeply equal {}

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] EqualityOperator
src/main/utils/systemInfo.js:13:13
         return response.data;
       } catch (e) {
         console.error("Error invoking axios.get: ", e);
-        if (e.response?.status === 404) {
+        if (e.response?.status !== 404) {
           return {};
         }
killedBy: utils/systemInfo tests useSystemInfo tests systemInfo when API unreachable
statusReason: expected { springH2ConsoleEnabled: false, …(1) } to deeply equal {}

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ObjectLiteral
src/main/utils/systemInfo.js:19:5
         throw e;
       }
     },
-    {
-      placeholderData: {
-        springH2ConsoleEnabled: false,
-        showSwaggerUILink: false,
-      },
-    },
+    {},
   );
 }
killedBy: LoginPage tests renders without crashing when lists return empty list
statusReason: Cannot read properties of undefined (reading 'oauthLogin')

[Survived] BooleanLiteral
src/main/utils/systemInfo.js:21:33
     },
     {
       placeholderData: {
-        springH2ConsoleEnabled: false,
+        springH2ConsoleEnabled: true,
         showSwaggerUILink: false,
       },
