[Killed] BlockStatement
main/components/Announcement/AnnouncementTable.jsx:17:34
   const queryClient = useQueryClient();
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(
-      `/admin/announcements/${cell.row.original.commonsId}/edit/${cell.row.original.id}`,
-    );
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: AdminAnnouncementsPage tests renders announcements with correct commons name and admin buttons
statusReason: expected "spy" to be called with arguments: [ '/admin/announcements/1/edit/1' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ArrayDeclaration
main/components/Announcement/AnnouncementTable.jsx:41:19
     deleteMutation.mutate(cell);
   };
 
-  const columns = [
-    {
-      Header: "id",
-      accessor: "id",
-    },
-    {
-      Header: "Start Date ISO Format",
-      accessor: "startDate",
-    },
-    {
-      Header: "End Date ISO Format",
-      accessor: "endDate",
-    },
-    {
-      Header: "Announcement",
-      accessor: "announcementText",
-    },
-  ];
+  const columns = [];
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
killedBy: AdminAnnouncementsPage tests renders page without crashing when there are no announcements
statusReason: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
