[Killed] OptionalChaining
src/main/pages/AdminAnnouncementsPage.jsx:39:23
   );
   // Stryker restore all
 
-  const commonsName = commonsPlus?.commons?.name;
+  const commonsName = commonsPlus?.commons.name;
   const announcements = announcementsPage?.content || [];
 
killedBy: AdminAnnouncementsPage tests renders even when commonsPlus has no commons object
statusReason: expect(element).toBeInTheDocument()

element could not be found in the document

[Killed] OptionalChaining
src/main/pages/AdminAnnouncementsPage.jsx:39:23
   );
   // Stryker restore all
 
-  const commonsName = commonsPlus?.commons?.name;
+  const commonsName = commonsPlus.commons?.name;
   const announcements = announcementsPage?.content || [];
 
killedBy: AdminAnnouncementsPage tests renders page without crashing when there are no announcements
statusReason: Cannot read properties of undefined (reading 'commons')

[Killed] ConditionalExpression
src/main/pages/AdminAnnouncementsPage.jsx:40:25
   // Stryker restore all
 
   const commonsName = commonsPlus?.commons?.name;
-  const announcements = announcementsPage?.content || [];
+  const announcements = false;
 
   return (
killedBy: AdminAnnouncementsPage tests renders page without crashing when there are no announcements
statusReason: data.forEach is not a function

[Killed] ConditionalExpression
src/main/pages/AdminAnnouncementsPage.jsx:40:25
   // Stryker restore all
 
   const commonsName = commonsPlus?.commons?.name;
-  const announcements = announcementsPage?.content || [];
+  const announcements = true;
 
   return (
killedBy: AdminAnnouncementsPage tests renders page without crashing when there are no announcements
statusReason: data.forEach is not a function
