[Killed] BlockStatement
src/main/pages/AdminCreateAnnouncementsPage.jsx:27:49
 
   const commonsName = commonsPlus?.commons?.name;
 
-  const objectToAxiosParams = (announcement) => {
-    const params = {
-      commonsId: commonsId,
-      endDate: announcement.endDate || null,
-      announcementText: announcement.announcementText,
-    };
-
-    if (announcement.startDate) {
-      params.startDate = announcement.startDate;
-    }
-
-    return {
-      url: "/api/announcements/post",
-      method: "POST",
-      params,
-    };
-  };
+  const objectToAxiosParams = (announcement) => {};
 
   const onSuccess = (announcement) => {
killedBy: AdminCreateAnnouncementsPage tests submitting with all fields sends correct post params and redirects
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
src/main/pages/AdminCreateAnnouncementsPage.jsx:28:20
   const commonsName = commonsPlus?.commons?.name;
 
   const objectToAxiosParams = (announcement) => {
-    const params = {
-      commonsId: commonsId,
-      endDate: announcement.endDate || null,
-      announcementText: announcement.announcementText,
-    };
+    const params = {};
 
     if (announcement.startDate) {
killedBy: AdminCreateAnnouncementsPage tests submitting with all fields sends correct post params and redirects
statusReason: expected { startDate: '2026-05-20T12:30' } to deeply equal { commonsId: 1, …(3) }

[Killed] ConditionalExpression
src/main/pages/AdminCreateAnnouncementsPage.jsx:30:16
   const objectToAxiosParams = (announcement) => {
     const params = {
       commonsId: commonsId,
-      endDate: announcement.endDate || null,
+      endDate: false,
       announcementText: announcement.announcementText,
     };
killedBy: AdminCreateAnnouncementsPage tests submitting with all fields sends correct post params and redirects
statusReason: expected { commonsId: 1, endDate: false, …(2) } to deeply equal { commonsId: 1, …(3) }

[Killed] LogicalOperator
src/main/pages/AdminCreateAnnouncementsPage.jsx:30:16
   const objectToAxiosParams = (announcement) => {
     const params = {
       commonsId: commonsId,
-      endDate: announcement.endDate || null,
+      endDate: announcement.endDate && null,
       announcementText: announcement.announcementText,
     };
killedBy: AdminCreateAnnouncementsPage tests submitting with all fields sends correct post params and redirects
statusReason: expected { commonsId: 1, endDate: null, …(2) } to deeply equal { commonsId: 1, …(3) }

[Killed] BlockStatement
src/main/pages/AdminCreateAnnouncementsPage.jsx:34:33
       announcementText: announcement.announcementText,
     };
 
-    if (announcement.startDate) {
-      params.startDate = announcement.startDate;
-    }
+    if (announcement.startDate) {}
 
     return {
killedBy: AdminCreateAnnouncementsPage tests submitting with all fields sends correct post params and redirects
statusReason: expected { commonsId: 1, …(2) } to deeply equal { commonsId: 1, …(3) }

[Killed] ConditionalExpression
src/main/pages/AdminCreateAnnouncementsPage.jsx:34:9
       announcementText: announcement.announcementText,
     };
 
-    if (announcement.startDate) {
+    if (false) {
       params.startDate = announcement.startDate;
     }
killedBy: AdminCreateAnnouncementsPage tests submitting with all fields sends correct post params and redirects
statusReason: expected { commonsId: 1, …(2) } to deeply equal { commonsId: 1, …(3) }

[Killed] BlockStatement
src/main/pages/AdminCreateAnnouncementsPage.jsx:45:39
     };
   };
 
-  const onSuccess = (announcement) => {
-    toast(`New Announcement Created - id: ${announcement.id}`);
-    navigate(`/admin/announcements/${commonsId}`);
-  };
+  const onSuccess = (announcement) => {};
 
   // Stryker disable all
killedBy: AdminCreateAnnouncementsPage tests submitting with all fields sends correct post params and redirects
statusReason: expected "spy" to be called with arguments: [ 'New Announcement Created - id: 17' ]

Number of calls: 0
