[Killed] BooleanLiteral
src/main/pages/AdminEditAnnouncementsPage.jsx:39:9
   const commonsName = commonsPlus?.commons?.name;
 
   const formatDateForInput = (dateString) => {
-    if (!dateString) return "";
+    if (dateString) return "";
     const hasTimezone = /(?:Z|[+-]\d{2}:?\d{2})$/i.test(dateString);
     if (!hasTimezone) return dateString.substring(0, 16);
killedBy: AdminEditAnnouncementsPage tests renders page with commons name and cleaned date values
statusReason: expect(element).toHaveValue(2026-05-20T12:30)

Expected the element to have value:
  2026-05-20T12:30
Received:

[Killed] ConditionalExpression
src/main/pages/AdminEditAnnouncementsPage.jsx:39:9
   const commonsName = commonsPlus?.commons?.name;
 
   const formatDateForInput = (dateString) => {
-    if (!dateString) return "";
+    if (false) return "";
     const hasTimezone = /(?:Z|[+-]\d{2}:?\d{2})$/i.test(dateString);
     if (!hasTimezone) return dateString.substring(0, 16);
killedBy: AdminEditAnnouncementsPage tests blank startDate and endDate from backend are converted to empty form values
statusReason: Unable to find an element by: [data-testid="AnnouncementForm-id"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] BooleanLiteral
src/main/pages/AdminEditAnnouncementsPage.jsx:41:9
   const formatDateForInput = (dateString) => {
     if (!dateString) return "";
     const hasTimezone = /(?:Z|[+-]\d{2}:?\d{2})$/i.test(dateString);
-    if (!hasTimezone) return dateString.substring(0, 16);
+    if (hasTimezone) return dateString.substring(0, 16);
 
     const date = new Date(dateString);
killedBy: AdminEditAnnouncementsPage tests renders page with commons name and cleaned date values
statusReason: expect(element).toHaveValue(2026-05-20T12:30)

Expected the element to have value:
  2026-05-20T12:30
Received:
  2026-05-20T19:30

[Killed] MethodExpression
src/main/pages/AdminEditAnnouncementsPage.jsx:41:30
   const formatDateForInput = (dateString) => {
     if (!dateString) return "";
     const hasTimezone = /(?:Z|[+-]\d{2}:?\d{2})$/i.test(dateString);
-    if (!hasTimezone) return dateString.substring(0, 16);
+    if (!hasTimezone) return dateString;
 
     const date = new Date(dateString);
killedBy: AdminEditAnnouncementsPage tests date values without timezone are trimmed for datetime-local inputs
statusReason: expect(element).toHaveValue(2026-05-20T12:30)

Expected the element to have value:
  2026-05-20T12:30
Received:
  2026-05-20T12:30:45.000

[Killed] ConditionalExpression
src/main/pages/AdminEditAnnouncementsPage.jsx:44:9
     if (!hasTimezone) return dateString.substring(0, 16);
 
     const date = new Date(dateString);
-    if (Number.isNaN(date.getTime())) return "";
+    if (true) return "";
 
     const parts = new Intl.DateTimeFormat("en-US", {
killedBy: AdminEditAnnouncementsPage tests renders page with commons name and cleaned date values
statusReason: expect(element).toHaveValue(2026-05-20T12:30)

Expected the element to have value:
  2026-05-20T12:30
Received:

[Killed] ConditionalExpression
src/main/pages/AdminEditAnnouncementsPage.jsx:44:9
     if (!hasTimezone) return dateString.substring(0, 16);
 
     const date = new Date(dateString);
-    if (Number.isNaN(date.getTime())) return "";
+    if (false) return "";
 
     const parts = new Intl.DateTimeFormat("en-US", {
killedBy: AdminEditAnnouncementsPage tests invalid timezone date values are converted to empty form values
statusReason: Unable to find an element by: [data-testid="AnnouncementForm-id"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] StringLiteral
src/main/pages/AdminEditAnnouncementsPage.jsx:46:43
     const date = new Date(dateString);
     if (Number.isNaN(date.getTime())) return "";
 
-    const parts = new Intl.DateTimeFormat("en-US", {
+    const parts = new Intl.DateTimeFormat("", {
       timeZone: "America/Los_Angeles",
       year: "numeric",
killedBy: AdminEditAnnouncementsPage tests renders page with commons name and cleaned date values
statusReason: expect(element).toBeInTheDocument()

element could not be found in the document

[Killed] StringLiteral
src/main/pages/AdminEditAnnouncementsPage.jsx:48:13
 
     const parts = new Intl.DateTimeFormat("en-US", {
       timeZone: "America/Los_Angeles",
-      year: "numeric",
+      year: "",
       month: "2-digit",
       day: "2-digit",
killedBy: AdminEditAnnouncementsPage tests renders page with commons name and cleaned date values
statusReason: expect(element).toBeInTheDocument()

element could not be found in the document

[Killed] StringLiteral
src/main/pages/AdminEditAnnouncementsPage.jsx:49:14
     const parts = new Intl.DateTimeFormat("en-US", {
       timeZone: "America/Los_Angeles",
       year: "numeric",
-      month: "2-digit",
+      month: "",
       day: "2-digit",
       hour: "2-digit",
killedBy: AdminEditAnnouncementsPage tests renders page with commons name and cleaned date values
statusReason: expect(element).toBeInTheDocument()

element could not be found in the document

[Killed] BooleanLiteral
src/main/pages/AdminEditAnnouncementsPage.jsx:53:15
       day: "2-digit",
       hour: "2-digit",
       minute: "2-digit",
-      hour12: false,
+      hour12: true,
       hourCycle: "h23",
     })
killedBy: AdminEditAnnouncementsPage tests renders page with commons name and cleaned date values
statusReason: expect(element).toHaveValue(2026-05-21T13:45)

Expected the element to have value:
  2026-05-21T13:45
Received:
  2026-05-21T01:45

[Killed] BlockStatement
src/main/pages/AdminEditAnnouncementsPage.jsx:57:30
       hourCycle: "h23",
     })
       .formatToParts(date)
-      .reduce((acc, part) => {
-        acc[part.type] = part.value;
-        return acc;
-      }, {});
+      .reduce((acc, part) => {}, {});
 
     const hour = parts.hour === "24" ? "00" : parts.hour;
killedBy: AdminEditAnnouncementsPage tests renders page with commons name and cleaned date values
statusReason: expect(element).toBeInTheDocument()

element could not be found in the document

[Killed] EqualityOperator
src/main/pages/AdminEditAnnouncementsPage.jsx:62:18
         return acc;
       }, {});
 
-    const hour = parts.hour === "24" ? "00" : parts.hour;
+    const hour = parts.hour !== "24" ? "00" : parts.hour;
     return `${parts.year}-${parts.month}-${parts.day}T${hour}:${parts.minute}`;
   };
killedBy: AdminEditAnnouncementsPage tests renders page with commons name and cleaned date values
statusReason: expect(element).toHaveValue(2026-05-20T12:30)

Expected the element to have value:
  2026-05-20T12:30
Received:
  2026-05-20T00:30

[Killed] ConditionalExpression
src/main/pages/AdminEditAnnouncementsPage.jsx:62:18
         return acc;
       }, {});
 
-    const hour = parts.hour === "24" ? "00" : parts.hour;
+    const hour = true ? "00" : parts.hour;
     return `${parts.year}-${parts.month}-${parts.day}T${hour}:${parts.minute}`;
   };
killedBy: AdminEditAnnouncementsPage tests renders page with commons name and cleaned date values
statusReason: expect(element).toHaveValue(2026-05-20T12:30)

Expected the element to have value:
  2026-05-20T12:30
Received:
  2026-05-20T00:30

[Killed] ArrowFunction
src/main/pages/AdminEditAnnouncementsPage.jsx:74:31
       }
     : null;
 
-  const objectToAxiosParams = (announcement) => ({
-    url: "/api/announcements/put",
-    method: "PUT",
-    params: {
-      id: id,
-      commonsId: commonsId,
-      startDate: announcement.startDate,
-      endDate: announcement.endDate || null,
-      announcementText: announcement.announcementText,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (announcement) => {
killedBy: AdminEditAnnouncementsPage tests submitting edit uses id from URL params, not the disabled form id
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
src/main/pages/AdminEditAnnouncementsPage.jsx:74:50
       }
     : null;
 
-  const objectToAxiosParams = (announcement) => ({
-    url: "/api/announcements/put",
-    method: "PUT",
-    params: {
-      id: id,
-      commonsId: commonsId,
-      startDate: announcement.startDate,
-      endDate: announcement.endDate || null,
-      announcementText: announcement.announcementText,
-    },
-  });
+  const objectToAxiosParams = (announcement) => ({});
 
   const onSuccess = (announcement) => {
killedBy: AdminEditAnnouncementsPage tests submitting edit uses id from URL params, not the disabled form id
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
src/main/pages/AdminEditAnnouncementsPage.jsx:76:13
 
   const objectToAxiosParams = (announcement) => ({
     url: "/api/announcements/put",
-    method: "PUT",
+    method: "",
     params: {
       id: id,
killedBy: AdminEditAnnouncementsPage tests submitting edit uses id from URL params, not the disabled form id
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ConditionalExpression
src/main/pages/AdminEditAnnouncementsPage.jsx:81:16
       id: id,
       commonsId: commonsId,
       startDate: announcement.startDate,
-      endDate: announcement.endDate || null,
+      endDate: false,
       announcementText: announcement.announcementText,
     },
killedBy: AdminEditAnnouncementsPage tests submitting edit uses id from URL params, not the disabled form id
statusReason: expected { id: 17, commonsId: 1, …(3) } to deeply equal { id: 17, commonsId: 1, …(3) }

[Killed] LogicalOperator
src/main/pages/AdminEditAnnouncementsPage.jsx:81:16
       id: id,
       commonsId: commonsId,
       startDate: announcement.startDate,
-      endDate: announcement.endDate || null,
+      endDate: announcement.endDate && null,
       announcementText: announcement.announcementText,
     },
killedBy: AdminEditAnnouncementsPage tests submitting edit uses id from URL params, not the disabled form id
statusReason: expected { id: 17, commonsId: 1, …(3) } to deeply equal { id: 17, commonsId: 1, …(3) }

[Killed] BlockStatement
src/main/pages/AdminEditAnnouncementsPage.jsx:86:39
     },
   });
 
-  const onSuccess = (announcement) => {
-    toast(`Announcement Updated - id: ${announcement.id}`);
-    navigate(`/admin/announcements/${commonsId}`);
-  };
+  const onSuccess = (announcement) => {};
 
   // Stryker disable all
killedBy: AdminEditAnnouncementsPage tests submitting edit uses id from URL params, not the disabled form id
statusReason: expected "spy" to be called with arguments: [ 'Announcement Updated - id: 17' ]

Number of calls: 0

[Killed] StringLiteral
src/main/pages/AdminEditAnnouncementsPage.jsx:87:11
   });
 
   const onSuccess = (announcement) => {
-    toast(`Announcement Updated - id: ${announcement.id}`);
+    toast(``);
     navigate(`/admin/announcements/${commonsId}`);
   };
killedBy: AdminEditAnnouncementsPage tests submitting edit uses id from URL params, not the disabled form id
statusReason: expected "spy" to be called with arguments: [ 'Announcement Updated - id: 17' ]

Received: 

  1st spy call:

  [
-   "Announcement Updated - id: 17",

[Killed] StringLiteral
src/main/pages/AdminEditAnnouncementsPage.jsx:88:14
 
   const onSuccess = (announcement) => {
     toast(`Announcement Updated - id: ${announcement.id}`);
-    navigate(`/admin/announcements/${commonsId}`);
+    navigate(``);
   };
 
killedBy: AdminEditAnnouncementsPage tests submitting edit uses id from URL params, not the disabled form id
statusReason: expected "spy" to be called with arguments: [ '/admin/announcements/1' ]

Received: 

  1st spy call:

  [
-   "/admin/announcements/1",

[Killed] LogicalOperator
src/main/pages/AdminEditAnnouncementsPage.jsx:106:10
       <div className="pt-2">
         <h1>Edit Announcement</h1>
         <h2>for Commons {commonsName}</h2>
-        {initialContents && (
-          <AnnouncementForm
-            submitAction={submitAction}
-            buttonLabel={"Update"}
-            initialContents={initialContents}
-          />
-        )}
+        {initialContents || <AnnouncementForm submitAction={submitAction} buttonLabel={"Update"} initialContents={initialContents} />}
       </div>
     </BasicLayout>
killedBy: AdminEditAnnouncementsPage tests renders header but form is not present until announcement is loaded
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  class="btn btn-primary"
  data-testid="AnnouncementForm-submit"
  type="submit"
>
  Update

[Killed] ConditionalExpression
src/main/pages/AdminEditAnnouncementsPage.jsx:106:10
       <div className="pt-2">
         <h1>Edit Announcement</h1>
         <h2>for Commons {commonsName}</h2>
-        {initialContents && (
-          <AnnouncementForm
-            submitAction={submitAction}
-            buttonLabel={"Update"}
-            initialContents={initialContents}
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: AdminEditAnnouncementsPage tests renders page with commons name and cleaned date values
statusReason: Unable to find an element by: [data-testid="AnnouncementForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
