[Killed] BlockStatement
src/main/utils/announcementUtils.js:3:42
 import { toast } from "react-toastify";
 
-export function onDeleteSuccess(message) {
-  console.log(message);
-  toast("Announcement deleted");
-}
+export function onDeleteSuccess(message) {}
 
 export function cellToAxiosParamsDelete(cell) {
killedBy: AnnouncementTable tests Delete button sends the correct delete request and shows success toast
statusReason: expected "spy" to be called with arguments: [ 'Announcement deleted' ]

Number of calls: 0
