[Killed] LogicalOperator
main/components/Announcement/AnnouncementForm.jsx:81:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.startDate && "Start Date must be provided in ISO format."}
+          {errors.startDate || "Start Date must be provided in ISO format."}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: AnnouncementForm tests that the correct validations are performed
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="invalid-feedback"
>
  Start Date must be provided in ISO format.
</div> instead
