[Killed] LogicalOperator
main/components/Announcement/AnnouncementTable.jsx:20:26
   const navigate = useNavigate();
 
   const editCallback = (cell) => {
-    const rowCommonsId = commonsId || cell.row.values.commonsId;
+    const rowCommonsId = commonsId && cell.row.values.commonsId;
     navigate(`/admin/announcements/${rowCommonsId}/edit/${cell.row.values.id}`);
   };
killedBy: AnnouncementTable tests Edit button navigates to the edit page
statusReason: expected "spy" to be called with arguments: [ '/admin/announcements/1/edit/1' ]

Received: 

  1st spy call:

  [
-   "/admin/announcements/1/edit/1",

[Killed] StringLiteral
main/components/Announcement/AnnouncementTable.jsx:49:17
     },
     {
       Header: "End Date ISO Format",
-      accessor: "endDate",
+      accessor: "",
     },
     {
killedBy: AnnouncementTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="AnnouncementTable-cell-row-0-col-endDate"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >
