[Killed] BlockStatement
src/main/pages/AdminCreateAnnouncementsPage.jsx:31:49
   );
   // Stryker restore all
 
-  const objectToAxiosParams = (announcement) => {
-    const params = {
-      commonsId,
-      announcementText: announcement.announcementText,
-    };
-    nonBlankParam(params, "startDate", toBackendDateTime(announcement.startDate));
-    nonBlankParam(params, "endDate", toBackendDateTime(announcement.endDate));
-
-    return {
-      url: "/api/announcements/post",
-      method: "POST",
-      params,
-    };
-  };
+  const objectToAxiosParams = (announcement) => {};
 
   const onSuccess = (announcement) => {
killedBy: AdminCreateAnnouncementsPage tests creates announcement without optional dates
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
src/main/pages/AdminCreateAnnouncementsPage.jsx:37:27
       announcementText: announcement.announcementText,
     };
     nonBlankParam(params, "startDate", toBackendDateTime(announcement.startDate));
-    nonBlankParam(params, "endDate", toBackendDateTime(announcement.endDate));
+    nonBlankParam(params, "", toBackendDateTime(announcement.endDate));
 
     return {
killedBy: AdminCreateAnnouncementsPage tests creates announcement with formatted start and end dates
statusReason: expected { commonsId: 1, …(3) } to deeply equal { commonsId: 1, …(3) }
