[Killed] BlockStatement
src/main/pages/AdminEditAnnouncementsPage.jsx:46:56
   );
   // Stryker restore all
 
-  const objectToAxiosParams = (updatedAnnouncement) => {
-    const params = {
-      id,
-      commonsId,
-      announcementText: updatedAnnouncement.announcementText,
-    };
-    nonBlankParam(
-      params,
-      "startDate",
-      toBackendDateTime(updatedAnnouncement.startDate),
-    );
-    nonBlankParam(params, "endDate", toBackendDateTime(updatedAnnouncement.endDate));
-
-    return {
-      url: "/api/announcements/put",
-      method: "PUT",
-      params,
-    };
-  };
+  const objectToAxiosParams = (updatedAnnouncement) => {};
 
   const onSuccess = () => {
killedBy: AdminEditAnnouncementsPage tests updates announcement with formatted start and end dates
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
src/main/pages/AdminEditAnnouncementsPage.jsx:57:27
       "startDate",
       toBackendDateTime(updatedAnnouncement.startDate),
     );
-    nonBlankParam(params, "endDate", toBackendDateTime(updatedAnnouncement.endDate));
+    nonBlankParam(params, "", toBackendDateTime(updatedAnnouncement.endDate));
 
     return {
killedBy: AdminEditAnnouncementsPage tests updates announcement with formatted start and end dates
statusReason: expected { id: 5, commonsId: 1, …(3) } to deeply equal { id: 5, commonsId: 1, …(3) }

[Killed] StringLiteral
src/main/pages/AdminEditAnnouncementsPage.jsx:71:35
     queryClient.invalidateQueries(
       `/api/announcements/getbycommonsid?commonsId=${commonsId}`,
     );
-    queryClient.invalidateQueries(`/api/announcements/getbyid?id=${id}`);
+    queryClient.invalidateQueries(``);
   };
 
killedBy: AdminEditAnnouncementsPage tests updates announcement with formatted start and end dates
statusReason: expected "invalidateQueries" to be called with arguments: [ '/api/announcements/getbyid?id=5' ]

Received: 

  1st invalidateQueries call:

  [
-   "/api/announcements/getbyid?id=5",

[Killed] ConditionalExpression
src/main/pages/AdminEditAnnouncementsPage.jsx:92:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Announcement for Commons {commonsName}</h1>
-        {announcement && (
-          <AnnouncementForm
-            initialContents={announcement}
-            submitAction={submitAction}
-            buttonLabel="Update"
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: AdminEditAnnouncementsPage tests renders and populates form with announcement data
statusReason: Unable to find an element by: [data-testid="AnnouncementForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
