[Killed] BlockStatement
src/main/utils/announcementUtils.js:18:51
   };
 }
 
-export function toBackendDateTime(dateTimeString) {
-  if (!dateTimeString) {
-    return undefined;
-  }
-
-  return new Intl.DateTimeFormat("en-US", {
-    month: "short",
-    day: "numeric",
-    year: "numeric",
-    hour: "numeric",
-    minute: "2-digit",
-    second: "2-digit",
-    hour12: true,
-  }).format(new Date(dateTimeString));
-}
+export function toBackendDateTime(dateTimeString) {}
 
killedBy: AdminCreateAnnouncementsPage tests creates announcement with formatted start and end dates
statusReason: expected { commonsId: 1, …(1) } to deeply equal { commonsId: 1, …(3) }

[Killed] StringLiteral
src/main/utils/announcementUtils.js:23:34
     return undefined;
   }
 
-  return new Intl.DateTimeFormat("en-US", {
+  return new Intl.DateTimeFormat("", {
     month: "short",
     day: "numeric",
killedBy: AdminEditAnnouncementsPage tests updates announcement with formatted start and end dates
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
src/main/utils/announcementUtils.js:23:43
     return undefined;
   }
 
-  return new Intl.DateTimeFormat("en-US", {
-    month: "short",
-    day: "numeric",
-    year: "numeric",
-    hour: "numeric",
-    minute: "2-digit",
-    second: "2-digit",
-    hour12: true,
-  }).format(new Date(dateTimeString));
+  return new Intl.DateTimeFormat("en-US", {}).format(new Date(dateTimeString));
 }
 
killedBy: AdminCreateAnnouncementsPage tests creates announcement with formatted start and end dates
statusReason: expected { commonsId: 1, …(3) } to deeply equal { commonsId: 1, …(3) }

[Killed] StringLiteral
src/main/utils/announcementUtils.js:25:10
 
   return new Intl.DateTimeFormat("en-US", {
     month: "short",
-    day: "numeric",
+    day: "",
     year: "numeric",
     hour: "numeric",
killedBy: AdminCreateAnnouncementsPage tests creates announcement with formatted start and end dates
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
src/main/utils/announcementUtils.js:27:11
     month: "short",
     day: "numeric",
     year: "numeric",
-    hour: "numeric",
+    hour: "",
     minute: "2-digit",
     second: "2-digit",
killedBy: AdminEditAnnouncementsPage tests updates announcement with formatted start and end dates
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BooleanLiteral
src/main/utils/announcementUtils.js:30:13
     hour: "numeric",
     minute: "2-digit",
     second: "2-digit",
-    hour12: true,
+    hour12: false,
   }).format(new Date(dateTimeString));
 }
killedBy: AdminEditAnnouncementsPage tests updates announcement with formatted start and end dates
statusReason: expected { id: 5, commonsId: 1, …(3) } to deeply equal { id: 5, commonsId: 1, …(3) }
