[Killed] BlockStatement
main/components/Announcement/AnnouncementForm.jsx:10:47
   submitAction,
   buttonLabel = "Create",
 }) {
-  const toDateTimeLocal = (dateTimeString) => {
-    if (!dateTimeString) {
-      return "";
-    }
-    const date = new Date(dateTimeString);
-    const pad = (number) => String(number).padStart(2, "0");
-    return `${date.getFullYear()}-${pad(date.getMonth() + 1)}-${pad(
-      date.getDate(),
-    )}T${pad(date.getHours())}:${pad(date.getMinutes())}`;
-  };
+  const toDateTimeLocal = (dateTimeString) => {};
 
   const modifiedContents = initialContents
killedBy: AdminEditAnnouncementsPage tests renders and populates form with announcement data
statusReason: expect(element).toHaveValue(2024-12-12T00:00)

Expected the element to have value:
  2024-12-12T00:00
Received:

[Killed] BooleanLiteral
main/components/Announcement/AnnouncementForm.jsx:11:9
   buttonLabel = "Create",
 }) {
   const toDateTimeLocal = (dateTimeString) => {
-    if (!dateTimeString) {
+    if (dateTimeString) {
       return "";
     }
killedBy: AnnouncementForm tests renders correctly when passing in initialContents
statusReason: expect(element).toHaveValue(2024-12-12T00:00)

Expected the element to have value:
  2024-12-12T00:00
Received:

[Killed] ConditionalExpression
main/components/Announcement/AnnouncementForm.jsx:11:9
   buttonLabel = "Create",
 }) {
   const toDateTimeLocal = (dateTimeString) => {
-    if (!dateTimeString) {
+    if (true) {
       return "";
     }
killedBy: AnnouncementForm tests renders correctly when passing in initialContents
statusReason: expect(element).toHaveValue(2024-12-12T00:00)

Expected the element to have value:
  2024-12-12T00:00
Received:

[Killed] ArrowFunction
main/components/Announcement/AnnouncementForm.jsx:15:17
       return "";
     }
     const date = new Date(dateTimeString);
-    const pad = (number) => String(number).padStart(2, "0");
+    const pad = () => undefined;
     return `${date.getFullYear()}-${pad(date.getMonth() + 1)}-${pad(
       date.getDate(),
killedBy: AdminEditAnnouncementsPage tests renders and populates form with announcement data
statusReason: expect(element).toHaveValue(2024-12-12T00:00)

Expected the element to have value:
  2024-12-12T00:00
Received:

[Killed] ArithmeticOperator
main/components/Announcement/AnnouncementForm.jsx:16:41
     }
     const date = new Date(dateTimeString);
     const pad = (number) => String(number).padStart(2, "0");
-    return `${date.getFullYear()}-${pad(date.getMonth() + 1)}-${pad(
+    return `${date.getFullYear()}-${pad(date.getMonth() - 1)}-${pad(
       date.getDate(),
     )}T${pad(date.getHours())}:${pad(date.getMinutes())}`;
killedBy: AnnouncementForm tests renders correctly when passing in initialContents
statusReason: expect(element).toHaveValue(2024-12-12T00:00)

Expected the element to have value:
  2024-12-12T00:00
Received:
  2024-10-12T00:00

[Killed] StringLiteral
main/components/Announcement/AnnouncementForm.jsx:40:24
 
   const navigate = useNavigate();
 
-  const testIdPrefix = "AnnouncementForm";
+  const testIdPrefix = "";
 
   // For explanation, see: https://stackoverflow.com/questions/3143070/javascript-regex-iso-datetime
killedBy: AnnouncementForm tests renders correctly when passing in initialContents
statusReason: Unable to find an element by: [data-testid="AnnouncementForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BlockStatement
main/components/Announcement/AnnouncementForm.jsx:49:46
   const isodate_regex =
     /(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d\.\d+)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d)/i;
 
-  const endDateAfterStartDate = (endDate) => {
-    const startDate = getValues("startDate");
-    if (!startDate || !endDate) {
-      return true;
-    }
-    return (
-      new Date(endDate) > new Date(startDate) ||
-      "End Date must be after the Start Date."
-    );
-  };
+  const endDateAfterStartDate = (endDate) => {};
 
   // Stryker disable next-line all
killedBy: AnnouncementForm tests endDate must be after startDate
statusReason: Unable to find an element with the text: /End Date must be after the Start Date./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Announcement/AnnouncementForm.jsx:50:33
     /(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d\.\d+)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d)/i;
 
   const endDateAfterStartDate = (endDate) => {
-    const startDate = getValues("startDate");
+    const startDate = getValues("");
     if (!startDate || !endDate) {
       return true;
killedBy: AnnouncementForm tests endDate must be after startDate
statusReason: Unable to find an element with the text: /End Date must be after the Start Date./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/Announcement/AnnouncementForm.jsx:51:9
 
   const endDateAfterStartDate = (endDate) => {
     const startDate = getValues("startDate");
-    if (!startDate || !endDate) {
+    if (false) {
       return true;
     }
killedBy: AnnouncementForm tests renders correctly when initialContents has no dates
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] BlockStatement
main/components/Announcement/AnnouncementForm.jsx:51:33
 
   const endDateAfterStartDate = (endDate) => {
     const startDate = getValues("startDate");
-    if (!startDate || !endDate) {
-      return true;
-    }
+    if (!startDate || !endDate) {}
     return (
       new Date(endDate) > new Date(startDate) ||
killedBy: AnnouncementForm tests renders correctly when initialContents has no dates
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] BooleanLiteral
main/components/Announcement/AnnouncementForm.jsx:52:14
   const endDateAfterStartDate = (endDate) => {
     const startDate = getValues("startDate");
     if (!startDate || !endDate) {
-      return true;
+      return false;
     }
     return (
killedBy: AnnouncementForm tests renders correctly when initialContents has no dates
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] ConditionalExpression
main/components/Announcement/AnnouncementForm.jsx:55:7
       return true;
     }
     return (
-      new Date(endDate) > new Date(startDate) ||
-      "End Date must be after the Start Date."
+      true
     );
   };
killedBy: AnnouncementForm tests endDate must be after startDate
statusReason: Unable to find an element with the text: /End Date must be after the Start Date./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/Announcement/AnnouncementForm.jsx:55:7
       return true;
     }
     return (
-      new Date(endDate) > new Date(startDate) ||
-      "End Date must be after the Start Date."
+      new Date(endDate) > new Date(startDate) && "End Date must be after the Start Date."
     );
   };
killedBy: AnnouncementForm tests endDate must be after startDate
statusReason: Unable to find an element with the text: /End Date must be after the Start Date./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Announcement/AnnouncementForm.jsx:56:7
     }
     return (
       new Date(endDate) > new Date(startDate) ||
-      "End Date must be after the Start Date."
+      ""
     );
   };
killedBy: AnnouncementForm tests endDate must be after startDate
statusReason: Unable to find an element with the text: /End Date must be after the Start Date./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Announcement/AnnouncementForm.jsx:88:37
           id="startDate"
           type="datetime-local"
           isInvalid={Boolean(errors.startDate)}
-          {...register("startDate", {
-            pattern: isodate_regex,
-          })}
+          {...register("startDate", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: AnnouncementForm tests that startDate pattern validation is performed
statusReason: Unable to find an element with the text: /Start Date must be provided in ISO format./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/Announcement/AnnouncementForm.jsx:93:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.startDate && "Start Date must be provided in ISO format."}
+          {false}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: AnnouncementForm tests that startDate pattern validation is performed
statusReason: Unable to find an element with the text: /Start Date must be provided in ISO format./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/Announcement/AnnouncementForm.jsx:93:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.startDate && "Start Date must be provided in ISO format."}
+          {true}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: AnnouncementForm tests that startDate pattern validation is performed
statusReason: Unable to find an element with the text: /Start Date must be provided in ISO format./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Announcement/AnnouncementForm.jsx:125:44
           id="announcementText"
           rows={5}
           isInvalid={Boolean(errors.announcementText)}
-          {...register("announcementText", {
-            required: "Announcement is required.",
-          })}
+          {...register("announcementText", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: AnnouncementForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Announcement is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/Announcement/AnnouncementForm.jsx:130:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.announcementText?.message}
+          {errors.announcementText.message}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: AnnouncementForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'message')
