[Killed] BlockStatement
main/components/Announcement/AnnouncementTable.jsx:20:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    const rowCommonsId = commonsId || cell.row.values.commonsId;
-    navigate(`/admin/announcements/${rowCommonsId}/edit/${cell.row.values.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: AnnouncementTable tests Edit button navigates to the edit page
statusReason: expected "spy" to be called with arguments: [ '/admin/announcements/1/edit/1' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
main/components/Announcement/AnnouncementTable.jsx:21:26
   const navigate = useNavigate();
 
   const editCallback = (cell) => {
-    const rowCommonsId = commonsId || cell.row.values.commonsId;
+    const rowCommonsId = true;
     navigate(`/admin/announcements/${rowCommonsId}/edit/${cell.row.values.id}`);
   };
killedBy: AnnouncementTable tests Edit button navigates to the edit page
statusReason: expected "spy" to be called with arguments: [ '/admin/announcements/1/edit/1' ]

Received: 

  1st spy call:

  [
-   "/admin/announcements/1/edit/1",

[Killed] ConditionalExpression
main/components/Announcement/AnnouncementTable.jsx:21:26
   const navigate = useNavigate();
 
   const editCallback = (cell) => {
-    const rowCommonsId = commonsId || cell.row.values.commonsId;
+    const rowCommonsId = false;
     navigate(`/admin/announcements/${rowCommonsId}/edit/${cell.row.values.id}`);
   };
killedBy: AnnouncementTable tests Edit button navigates to the edit page
statusReason: expected "spy" to be called with arguments: [ '/admin/announcements/1/edit/1' ]

Received: 

  1st spy call:

  [
-   "/admin/announcements/1/edit/1",

[Killed] ArrowFunction
main/components/Announcement/AnnouncementTable.jsx:47:13
     {
       Header: "Start Date",
       accessor: "startDate",
-      Cell: ({ cell }) => formatAnnouncementDateTime(cell.value),
+      Cell: () => undefined,
     },
     {
killedBy: AnnouncementTable tests Has the expected column headers, content and buttons for admin user
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  12/12/2024, 12:00 AM
Received:

[Killed] StringLiteral
main/components/Announcement/AnnouncementTable.jsx:51:17
     },
     {
       Header: "End Date",
-      accessor: "endDate",
+      accessor: "",
       Cell: ({ cell }) => formatAnnouncementDateTime(cell.value),
     },
killedBy: AnnouncementTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="AnnouncementTable-cell-row-0-col-endDate"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Survived] ArrowFunction
main/components/Announcement/AnnouncementTable.jsx:52:13
     {
       Header: "End Date",
       accessor: "endDate",
-      Cell: ({ cell }) => formatAnnouncementDateTime(cell.value),
+      Cell: () => undefined,
     },
     {

[Killed] ObjectLiteral
main/components/Announcement/AnnouncementTable.jsx:54:5
       accessor: "endDate",
       Cell: ({ cell }) => formatAnnouncementDateTime(cell.value),
     },
-    {
-      Header: "Announcement",
-      accessor: "announcementText",
-    },
+    {},
   ];
 
killedBy: AdminAnnouncementsPage tests renders page without crashing
statusReason: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Announcement/AnnouncementTable.jsx:55:15
       Cell: ({ cell }) => formatAnnouncementDateTime(cell.value),
     },
     {
-      Header: "Announcement",
+      Header: "",
       accessor: "announcementText",
     },
killedBy: AnnouncementTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Announcement. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] StringLiteral
main/components/Announcement/AnnouncementTable.jsx:56:17
     },
     {
       Header: "Announcement",
-      accessor: "announcementText",
+      accessor: "",
     },
   ];
killedBy: AnnouncementTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="AnnouncementTable-cell-row-0-col-announcementText"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] StringLiteral
main/components/Announcement/AnnouncementTable.jsx:73:15
     <OurTable
       data={announcements}
       columns={columns}
-      testid={"AnnouncementTable"}
+      testid={""}
     />
   );
killedBy: AnnouncementTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="AnnouncementTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >
