[Killed] ConditionalExpression
src/main/pages/AdminAnnouncementsPage.jsx:40:25
   // Stryker restore all
 
   const commonsName = commonsPlus?.commons.name;
-  const announcements = announcementsPage?.content || [];
+  const announcements = false;
 
   return (
killedBy: AdminAnnouncementsPage tests renders page without crashing
statusReason: data.forEach is not a function

[Killed] ConditionalExpression
src/main/pages/AdminAnnouncementsPage.jsx:40:25
   // Stryker restore all
 
   const commonsName = commonsPlus?.commons.name;
-  const announcements = announcementsPage?.content || [];
+  const announcements = true;
 
   return (
killedBy: AdminCreateAnnouncementsPage tests correct href for create announcements button as an admin
statusReason: data.forEach is not a function
