[Killed] BlockStatement
src/main/pages/AdminCreateAnnouncementsPage.jsx:9:47
 import { useBackend, useBackendMutation } from "main/utils/useBackend";
 import { toBackendDateTime } from "main/utils/announcementUtils";
 
-const nonBlankParam = (params, key, value) => {
-  if (value) {
-    params[key] = value;
-  }
-};
+const nonBlankParam = (params, key, value) => {};
 
 export default function AdminCreateAnnouncementsPage() {
killedBy: AdminCreateAnnouncementsPage tests creates announcement with formatted start and end dates
statusReason: expected { commonsId: 1, …(1) } to deeply equal { commonsId: 1, …(3) }

[Killed] ConditionalExpression
src/main/pages/AdminCreateAnnouncementsPage.jsx:10:7
 import { toBackendDateTime } from "main/utils/announcementUtils";
 
 const nonBlankParam = (params, key, value) => {
-  if (value) {
+  if (false) {
     params[key] = value;
   }
killedBy: AdminCreateAnnouncementsPage tests creates announcement with formatted start and end dates
statusReason: expected { commonsId: 1, …(1) } to deeply equal { commonsId: 1, …(3) }

[Killed] BlockStatement
src/main/pages/AdminCreateAnnouncementsPage.jsx:10:14
 import { toBackendDateTime } from "main/utils/announcementUtils";
 
 const nonBlankParam = (params, key, value) => {
-  if (value) {
-    params[key] = value;
-  }
+  if (value) {}
 };
 
killedBy: AdminCreateAnnouncementsPage tests creates announcement with formatted start and end dates
statusReason: expected { commonsId: 1, …(1) } to deeply equal { commonsId: 1, …(3) }

[Killed] BlockStatement
src/main/pages/AdminCreateAnnouncementsPage.jsx:31:49
   );
   // Stryker restore all
 
-  const objectToAxiosParams = (announcement) => {
-    const params = {
-      commonsId,
-      announcementText: announcement.announcementText,
-    };
-    nonBlankParam(
-      params,
-      "startDate",
-      toBackendDateTime(announcement.startDate),
-    );
-    nonBlankParam(params, "endDate", toBackendDateTime(announcement.endDate));
-
-    return {
-      url: "/api/announcements/post",
-      method: "POST",
-      params,
-    };
-  };
+  const objectToAxiosParams = (announcement) => {};
 
   const onSuccess = (announcement) => {
killedBy: AdminCreateAnnouncementsPage tests creates announcement without optional dates
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
src/main/pages/AdminCreateAnnouncementsPage.jsx:43:12
     );
     nonBlankParam(params, "endDate", toBackendDateTime(announcement.endDate));
 
-    return {
-      url: "/api/announcements/post",
-      method: "POST",
-      params,
-    };
+    return {};
   };
 
killedBy: AdminCreateAnnouncementsPage tests creates announcement without optional dates
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
src/main/pages/AdminCreateAnnouncementsPage.jsx:50:39
     };
   };
 
-  const onSuccess = (announcement) => {
-    toast(`Announcement created - id: ${announcement.id}`);
-  };
+  const onSuccess = (announcement) => {};
 
   // Stryker disable all
killedBy: AdminCreateAnnouncementsPage tests creates announcement without optional dates
statusReason: expected "spy" to be called with arguments: [ 'Announcement created - id: 5' ]

Number of calls: 0

[Killed] StringLiteral
src/main/pages/AdminCreateAnnouncementsPage.jsx:51:11
   };
 
   const onSuccess = (announcement) => {
-    toast(`Announcement created - id: ${announcement.id}`);
+    toast(``);
   };
 
killedBy: AdminCreateAnnouncementsPage tests creates announcement without optional dates
statusReason: expected "spy" to be called with arguments: [ 'Announcement created - id: 5' ]

Received: 

  1st spy call:

  [
-   "Announcement created - id: 5",

[Killed] BlockStatement
src/main/pages/AdminCreateAnnouncementsPage.jsx:64:27
     mutation.mutate(data);
   };
 
-  if (mutation.isSuccess) {
-    return <Navigate to={`/admin/announcements/${commonsId}`} />;
-  }
+  if (mutation.isSuccess) {}
 
   const commonsName = commonsPlus?.commons.name;
killedBy: AdminCreateAnnouncementsPage tests creates announcement without optional dates
statusReason: expected "spy" to be called with arguments: [ { to: '/admin/announcements/1' } ]

Number of calls: 0
