[Killed] ConditionalExpression
src/main/pages/AdminEditAnnouncementsPage.jsx:11:7
 import { toBackendDateTime } from "main/utils/announcementUtils";
 
 const nonBlankParam = (params, key, value) => {
-  if (value) {
+  if (true) {
     params[key] = value;
   }
killedBy: AdminEditAnnouncementsPage tests objectToAxiosParams omits blank optional dates before axios
statusReason: expected { id: 5, commonsId: 1, …(3) } to not have property "startDate"

[Killed] BlockStatement
src/main/pages/AdminEditAnnouncementsPage.jsx:46:56
   );
   // Stryker restore all
 
-  const objectToAxiosParams = (updatedAnnouncement) => {
-    const params = {
-      id,
-      commonsId,
-      announcementText: updatedAnnouncement.announcementText,
-    };
-    nonBlankParam(
-      params,
-      "startDate",
-      toBackendDateTime(updatedAnnouncement.startDate),
-    );
-    nonBlankParam(
-      params,
-      "endDate",
-      toBackendDateTime(updatedAnnouncement.endDate),
-    );
-
-    return {
-      url: "/api/announcements/put",
-      method: "PUT",
-      params,
-    };
-  };
+  const objectToAxiosParams = (updatedAnnouncement) => {};
 
   const onSuccess = () => {
killedBy: AdminEditAnnouncementsPage tests updates announcement with formatted start and end dates
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
src/main/pages/AdminEditAnnouncementsPage.jsx:59:7
     );
     nonBlankParam(
       params,
-      "endDate",
+      "",
       toBackendDateTime(updatedAnnouncement.endDate),
     );
killedBy: AdminEditAnnouncementsPage tests updates announcement with formatted start and end dates
statusReason: expected { id: 5, commonsId: 1, …(3) } to deeply equal { id: 5, commonsId: 1, …(3) }

[Killed] BlockStatement
src/main/pages/AdminEditAnnouncementsPage.jsx:70:27
     };
   };
 
-  const onSuccess = () => {
-    toast(`Announcement updated - id: ${id}`);
-    queryClient.invalidateQueries(
-      `/api/announcements/getbycommonsid?commonsId=${commonsId}`,
-    );
-    queryClient.invalidateQueries(`/api/announcements/getbyid?id=${id}`);
-  };
+  const onSuccess = () => {};
 
   // Stryker disable all
killedBy: AdminEditAnnouncementsPage tests updates announcement with formatted start and end dates
statusReason: expected "spy" to be called with arguments: [ 'Announcement updated - id: 5' ]

Number of calls: 0

[Killed] StringLiteral
src/main/pages/AdminEditAnnouncementsPage.jsx:71:11
   };
 
   const onSuccess = () => {
-    toast(`Announcement updated - id: ${id}`);
+    toast(``);
     queryClient.invalidateQueries(
       `/api/announcements/getbycommonsid?commonsId=${commonsId}`,
killedBy: AdminEditAnnouncementsPage tests updates announcement with formatted start and end dates
statusReason: expected "spy" to be called with arguments: [ 'Announcement updated - id: 5' ]

Received: 

  1st spy call:

  [
-   "Announcement updated - id: 5",

[Killed] ConditionalExpression
src/main/pages/AdminEditAnnouncementsPage.jsx:96:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Announcement for Commons {commonsName}</h1>
-        {announcement && (
-          <AnnouncementForm
-            initialContents={announcement}
-            submitAction={submitAction}
-            buttonLabel="Update"
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: AdminEditAnnouncementsPage tests renders and populates form with announcement data
statusReason: Unable to find an element by: [data-testid="AnnouncementForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
src/main/pages/AdminEditAnnouncementsPage.jsx:96:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Announcement for Commons {commonsName}</h1>
-        {announcement && (
-          <AnnouncementForm
-            initialContents={announcement}
-            submitAction={submitAction}
-            buttonLabel="Update"
-          />
-        )}
+        {announcement || <AnnouncementForm initialContents={announcement} submitAction={submitAction} buttonLabel="Update" />}
       </div>
     </BasicLayout>
killedBy: AdminEditAnnouncementsPage tests renders and populates form with announcement data
statusReason: Unable to find an element with the text: Edit Announcement for Commons Sample Commons. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
