[Killed] BlockStatement
src/main/utils/announcementUtils.js:3:42
 import { toast } from "react-toastify";
 
-export function onDeleteSuccess(message) {
-  console.log(message);
-  toast(`Announcement deleted - id: ${message.id}`);
-}
+export function onDeleteSuccess(message) {}
 
 export function cellToAxiosParamsDelete(cell) {
killedBy: AnnouncementUtils onDeleteSuccess It puts the message on console.log and in a toast
statusReason: expected "spy" to be called with arguments: [ 'Announcement deleted - id: 17' ]

Number of calls: 0

[Killed] StringLiteral
src/main/utils/announcementUtils.js:5:9
 
 export function onDeleteSuccess(message) {
   console.log(message);
-  toast(`Announcement deleted - id: ${message.id}`);
+  toast(``);
 }
 
killedBy: AnnouncementUtils onDeleteSuccess It puts the message on console.log and in a toast
statusReason: expected "spy" to be called with arguments: [ 'Announcement deleted - id: 17' ]

Received: 

  1st spy call:

  [
-   "Announcement deleted - id: 17",

[Killed] BlockStatement
src/main/utils/announcementUtils.js:18:51
   };
 }
 
-export function toBackendDateTime(dateTimeString) {
-  if (!dateTimeString) {
-    return undefined;
-  }
-
-  return new Date(dateTimeString).toISOString();
-}
+export function toBackendDateTime(dateTimeString) {}
 
 export function formatAnnouncementDateTime(dateTimeString) {
killedBy: AdminEditAnnouncementsPage tests updates announcement with formatted start and end dates
statusReason: expected { id: 5, commonsId: 1, …(1) } to deeply equal { id: 5, commonsId: 1, …(3) }

[Killed] BooleanLiteral
src/main/utils/announcementUtils.js:19:7
 }
 
 export function toBackendDateTime(dateTimeString) {
-  if (!dateTimeString) {
+  if (dateTimeString) {
     return undefined;
   }
killedBy: AdminCreateAnnouncementsPage tests creates announcement without optional dates
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ConditionalExpression
src/main/utils/announcementUtils.js:19:7
 }
 
 export function toBackendDateTime(dateTimeString) {
-  if (!dateTimeString) {
+  if (false) {
     return undefined;
   }
killedBy: AdminCreateAnnouncementsPage tests creates announcement without optional dates
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
src/main/utils/announcementUtils.js:26:60
   return new Date(dateTimeString).toISOString();
 }
 
-export function formatAnnouncementDateTime(dateTimeString) {
-  if (!dateTimeString) {
-    return "";
-  }
-
-  return new Intl.DateTimeFormat("en-US", {
-    year: "numeric",
-    month: "numeric",
-    day: "numeric",
-    hour: "numeric",
-    minute: "2-digit",
-  }).format(new Date(dateTimeString));
-}
+export function formatAnnouncementDateTime(dateTimeString) {}
 
killedBy: AnnouncementTable tests Has the expected column headers, content and buttons for admin user
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  undefined
Received:

[Killed] ConditionalExpression
src/main/utils/announcementUtils.js:27:7
 }
 
 export function formatAnnouncementDateTime(dateTimeString) {
-  if (!dateTimeString) {
+  if (true) {
     return "";
   }
killedBy: AnnouncementUtils formatAnnouncementDateTime It formats dates up to the minute
statusReason: expected '' to contain '3:04'

[Killed] BlockStatement
src/main/utils/announcementUtils.js:27:24
 }
 
 export function formatAnnouncementDateTime(dateTimeString) {
-  if (!dateTimeString) {
-    return "";
-  }
+  if (!dateTimeString) {}
 
   return new Intl.DateTimeFormat("en-US", {
killedBy: AnnouncementTable tests Has the expected column headers, content and buttons for admin user
statusReason: expect(element).toHaveTextContent()

Checking with empty string will always match, use .toBeEmptyDOMElement() instead:

Received:
  12/31/1969, 4:00 PM

[Killed] StringLiteral
src/main/utils/announcementUtils.js:28:12
 
 export function formatAnnouncementDateTime(dateTimeString) {
   if (!dateTimeString) {
-    return "";
+    return "Stryker was here!";
   }
 
killedBy: AnnouncementTable tests Has the expected column headers, content and buttons for admin user
statusReason: expect(element).toHaveTextContent()

Checking with empty string will always match, use .toBeEmptyDOMElement() instead:

Received:
  Stryker was here!
